{
    "timeline": [
        {
            "_id": "7190228529471245614",
            "datestring": "2023-01-19 00:19:05",
            "summary": "\n\nToday the speaker had a doctor's appointment and wanted to share an update on their health. They have a rare cancer, so they are seen by three different centers: MD Anderson for scans, National Cancer Institute for telehealth appointments, and a local oncologist for labs. The labs came back normal except for a slightly elevated billy rubin. The speaker has learned not to worry unless their doctors are worried, but they still have moments of fear. They shared their experience in order to show that even when things look good, there can still be a little worry. The speaker is currently on a 4.5 month scan schedule and their next scans are in March.",
            "text": " I had a doctor's appointment today and I realized it's been a while since I've given a health update. So, stay-tory cancer-inactive surveillance. Let's give the update. I used to give these updates when I was on treatment, but I also think it's important to share what active surveillance is like. It's a little bit different for me because I have a super rare cancer, but here's what it looks like for me. So, because I have such a rare cancer, I'm actually seen by three different centers. I go to MD Anderson for my scans, and that's also where my oncologist is. Then my scans are reviewed and I do telehealth appointments with the National Cancer Institute or the NIH. Because they're who did my surgery, and if I ever get any procedures done, they typically are the ones who do it. And then I have a third center, which is where I went today, and that is to my local oncologist. I usually just go for labs there, and that's why I did today. My labs today came back on normal except for my billy rubin, which is slightly elevated. I've had this up and down. Ever since surgery and my ablation, my numbers have always been a little bit off. Turns out the liver doesn't really like to be sliced and diced. We're burned. But I'm still here. So that's the important part. I thought I'd share that because it's a part of being on active surveillance for me. Like I feel really great right now, but that slight elevation in my billy rubin will still get in my head every now and then. Like I can't tell you how many pictures I have of my eyeball, making sure that I don't have John Dis. Am I aware of the fact that it's completely ridiculous? 100%. My doctors aren't too worried, and I solely over time have learned not to really worry unless my doctors are worried. But does it stop me from googling and doing ridiculous things? No, it does not. Most surveillance can feel frightening at times because you're actively not doing anything, and I know I used to be terrified of it. But it's actually a really good place to be. And I thought it was important to share this because sometimes when you see my post or a see-good news, it might look like I have it all together or that I'm not worried about things. But there's always a little bit of worry there. Like wondering if I ever have growth on a scan, if my liver could handle more treatment, or what wonky lab values mean, which is usually nothing. I've had plenty of labs that are off and then they just resolve on their own. So yeah, that's the update. Today I went for labs. We're read a little bit over a slightly wonky lab value. And now I just wait till my next scans. I'm currently on a 4.5 month scan schedule. And my next ones are coming up in March. See you next time.",
            "timestamp": 1674105545,
            "title": "\n\nToday the speaker had a doctor's appointment and wanted to share an update on their health",
            "user_id": "@katiekickscancer",
            "video_content_url": "https://v16-webapp.tiktok.com/25845a09e8db97ea82ad205b75037d56/63d0e170/video/tos/maliva/tos-maliva-ve-0068c799-us/6349b865e2454f989842a95f9595ffe3/",
            "video_page_url": "https://www.tiktok.com/@katiekickscancer/video/7190228529471245614",
            "video_path": "sample_data/katiekickscancer/video_content/7190228529471245614.mp4"
        },
        {
            "_id": "7190210592987155754",
            "datestring": "2023-01-18 23:09:29",
            "summary": "\n\nAnswering why someone moved to Texas can be an awkward question for some to answer. When people make small talk, the person answering may not be good at improvising and may be honest about the reason for the move. This can make the conversation uncomfortable for the other person as they were just trying to make small talk.",
            "text": " I have to say one of the most awkward questions for me to answer in person is when people ask me why I move to Texas. Like you know when people make small talk of like, oh are you originally from here? I'm not somebody who can improvise those moments. I'm like yeah, I moved here because I got cancer. And because I really like Austin. I always feel bad for the other person on the other side of that conversation. They're trying to make small talk and it instantly gets real deep. I don't mean for it to be, I just can't lie to you.",
            "timestamp": 1674101369,
            "title": "\n\nAnswering why someone moved to Texas can be an awkward question for some to answer",
            "user_id": "@katiekickscancer",
            "video_content_url": "https://v16-webapp.tiktok.com/b79dc0c1b5a60a9ff2e46a2cc2f2eea9/63d0e112/video/tos/maliva/tos-maliva-ve-0068c799-us/542769b5e61b43ef98bb0c7eb06f6af8/",
            "video_page_url": "https://www.tiktok.com/@katiekickscancer/video/7190210592987155754",
            "video_path": "sample_data/katiekickscancer/video_content/7190210592987155754.mp4"
        },
        {
            "_id": "7189110750714203438",
            "datestring": "2023-01-16 00:01:39",
            "summary": "\n\nAn exciting announcement is coming soon! The announcement will be made here on Friday, so stay tuned and start counting down!",
            "text": " I have exciting news coming soon. I think I'm going to announce it here on Friday. Let the countdown begin.",
            "timestamp": 1673845299,
            "title": "\n\nAn exciting announcement is coming soon! The announcement will be made here on Friday, so stay tuned and start counting down!",
            "user_id": "@katiekickscancer",
            "video_content_url": "https://v16-webapp.tiktok.com/64891e43a24c8001aed9b6cc390fb541/63d0e10b/video/tos/maliva/tos-maliva-ve-0068c799-us/861d3bcda7ac4a10a44625c840a82a19/",
            "video_page_url": "https://www.tiktok.com/@katiekickscancer/video/7189110750714203438",
            "video_path": "sample_data/katiekickscancer/video_content/7189110750714203438.mp4"
        },
        {
            "_id": "7187231576672062762",
            "datestring": "2023-01-10 22:29:30",
            "summary": "\n\nEnplace dans le corner est une expression française qui signifie \"mets-toi dans le coin\". Cela peut être utilisé pour demander à quelqu'un de se déplacer dans un coin spécifique ou pour suggérer qu'ils s'éloignent de la situation. La réponse habituelle à cette expression est \"Non, du coup!\" qui signifie \"Non, je ne vais pas le faire\".",
            "text": " Enplace dans le corner. Non, du coup!",
            "timestamp": 1673407770,
            "title": "\n\nEnplace dans le corner est une expression française qui signifie \"mets-toi dans le coin\"",
            "user_id": "@katiekickscancer",
            "video_content_url": "https://v16-webapp.tiktok.com/3157107093f01b4a51c9e763f07b8a44/63d0e123/video/tos/maliva/tos-maliva-ve-0068c799-us/e2c1e9a978074d26a0bd626df4b029b8/",
            "video_page_url": "https://www.tiktok.com/@katiekickscancer/video/7187231576672062762",
            "video_path": "sample_data/katiekickscancer/video_content/7187231576672062762.mp4"
        },
        {
            "_id": "7183747787111025962",
            "datestring": "2023-01-01 13:10:36",
            "summary": "\n\nYesterday was a special day for Kim Beahard as it marked two years since he was diagnosed with cancer. To celebrate, he and his husband went disgolfing, made pancake art, decorated a pie, and checked into a hotel downtown for dinner and fireworks. Kim made the most of the evening by playing a game where they had to take the sentence of anyone passing them and finish it with a story of their own. Despite a minor mishap with cutting the pie with a coffee stirrer, they were able to catch the fireworks and Kim was filled with appreciation for being able to experience the moment. Life is too short to not appreciate every day, he said.",
            "text": " Yesterday was a big day. Yesterday marks two years since I walked into the ER as a 29-year-old newlywed and walked out at the stage for cancer diagnosis. I quite literally didn't think I'd still be standing here today, so come with me and we'll be celebrating. For anyone who has cancer, today you got diagnosed Kim Beahard when he chair. Which is why I make an active choice to celebrate. We go full-out and turn the entire day into a celebration. Yeah, we're making pancake art here. That's a kidney with a tumor because I had kidney cancer. So we packed the day full of some of our favorite things. We went disgolfing, made pancake art. I decorated my pie for later and then we checked into a hotel downtown. So we could grab dinner and worship fireworks. My husband and I are kind of homebodies and I can count on one hand and then a number of times we'd be in a dinner this night. But it was fun to get out for the evening. I ordered my pasta and cheese well because how cool is that. And then I made up games as we ate. Like we had to take the sentence of anyone passing us and finish it with a story of her home. It was fun. I highly recommend it. Does on the other hand, I don't recommend. I forgot to bring a knife to cut the pie. So I'm cutting it with a coffee stirrer. And these clips are backwards. I actually made a wish first. I think I wish for a doctor because that's okay. And it's strong. And after my three-in-one wish, we walked over and were able to catch the reference, which I may or may not have cried through. Austin is my favorite city and I couldn't believe I'm still alive to experience this moment. I feel so lucky to be here. I appreciate every day folks. Life's way too short not to. And happy to freaking new year.",
            "timestamp": 1672596636,
            "title": "\n\nYesterday was a special day for Kim Beahard as it marked two years since he was diagnosed with cancer",
            "user_id": "@katiekickscancer",
            "video_content_url": "https://v16-webapp.tiktok.com/07b31fd312b9a6ed8ad9e7e8b2ac753e/63d0e188/video/tos/maliva/tos-maliva-ve-0068c799-us/054490666a48403eba9dc35637d82df5/",
            "video_page_url": "https://www.tiktok.com/@katiekickscancer/video/7183747787111025962",
            "video_path": "sample_data/katiekickscancer/video_content/7183747787111025962.mp4"
        },
        {
            "_id": "7183082626746436906",
            "datestring": "2022-12-30 18:09:20",
            "summary": "\n\nThis person has achieved their goal of writing 40,000 words in a private case. They have been too burned out to record a video about it, but are planning a special event to mark the anniversary of their diagnosis on New Year's Eve. They are also working on launching a non-profit soon.",
            "text": " In case y'all are wondering, I did it. I have 40,000 words in private case. Like writing for those that might just randomly come across this video. I actually hit it later that night. But I've been too burned out to record a cool video about it. And because as my husband might say, I don't know how to relax. So I've also been trying to plan for the tier anniversary of when I was diagnosed, which is tomorrow, on New Year's Eve. And I'm trying to get some non-profit stuff going that I'm working on soft launching. Soon. But yeah, so I did it.",
            "timestamp": 1672441760,
            "title": "\n\nThis person has achieved their goal of writing 40,000 words in a private case",
            "user_id": "@katiekickscancer",
            "video_content_url": "https://v16-webapp.tiktok.com/1eea65d601c3f90dee6d8293b7419982/63d0e14a/video/tos/maliva/tos-maliva-ve-0068c799-us/7b5c9beef4884e959d514ed00760e4b3/",
            "video_page_url": "https://www.tiktok.com/@katiekickscancer/video/7183082626746436906",
            "video_path": "sample_data/katiekickscancer/video_content/7183082626746436906.mp4"
        },
        {
            "_id": "7182788442986925358",
            "datestring": "2022-12-29 23:07:48",
            "summary": "\n\nThis passage speaks to the importance of recognizing and appreciating the moments in life that can bring joy, even when faced with difficult circumstances. The speaker reflects on their own experience of having cancer, and how they chose to focus on the things they could do in the present moment, such as walking their dog, rather than worrying about the treatment's effectiveness. This realization can lead to happiness for anyone, regardless of their situation.",
            "text": " That was like a very big moment for me that kind of woke me up to that fact of like, I can spend this entire time worrying about if my treatment is working or not and not getting out of bed and not doing anything or I can appreciate the fact that right now, regardless of if the treatment is working or not, I can go walk my dog, I can walk along the block, I can do all these things right now and that's what I need to live in. And I think that's something that, whether you have cancer or not, like that is something that truly can lead to happiness in anybody's life is being able to recognize those moments.",
            "timestamp": 1672373268,
            "title": "\n\nThis passage speaks to the importance of recognizing and appreciating the moments in life that can bring joy, even when faced with difficult circumstances",
            "user_id": "@katiekickscancer",
            "video_content_url": "https://v16-webapp.tiktok.com/f226b911089c95cb973a69ab515ed26e/63d0e14a/video/tos/maliva/tos-maliva-ve-0068c799-us/961f4e75a1124299a73ac2aac4e0936a/",
            "video_page_url": "https://www.tiktok.com/@katiekickscancer/video/7182788442986925358",
            "video_path": "sample_data/katiekickscancer/video_content/7182788442986925358.mp4"
        },
        {
            "_id": "7182768293793615146",
            "datestring": "2022-12-29 21:49:36",
            "summary": "\n\nThis photo is a reminder of the struggles faced by someone who was recently diagnosed with stage 4 cancer. Despite the smile on their face, they were holding back tears, worrying if this would be the last family photo they would take. They were hiding their mother in the photo, not wanting her to be a part of their social media presence. The person struggled a lot after their diagnosis, but eventually found a way to cope and be positive. They recently appeared on a podcast to talk about how they got from a place of sadness to a place of positivity.",
            "text": " I might look capy in this photo, but it took everything I had to hide the tears that were welling up behind my eyes the entire time. Because all I could think about was, is this going to be the last family photo I take? I'm hiding my mom behind me in this photo, just because I'm on TikTok doesn't mean everybody wants to be. I've had a lot of patients reach out to me and ask how I can be so happy or positive after receiving a stage 4 cancer diagnosis. And if you see me now, it might look like I've always been that way. But I have not. And I used to ask that exact same question to other patients. Because I really struggled when I was first diagnosed. And pictures is the perfect example of that. It took everything I had not to break down when I took a picture with family or friends. Because all I could think about was this going to be the last one. It's normal to feel sadder to press when you're diagnosed. And if you're wondering how I got from there to here, I was recently on a podcast where we talk about that exact thing. If you want to check it out, if you put the thing you click on, and the place that the things go.",
            "timestamp": 1672368576,
            "title": "\n\nThis photo is a reminder of the struggles faced by someone who was recently diagnosed with stage 4 cancer",
            "user_id": "@katiekickscancer",
            "video_content_url": "https://v16-webapp.tiktok.com/c03514496924facebef96218b0b6dda5/63d0e173/video/tos/maliva/tos-maliva-ve-0068c799-us/25091ef3407b4e00bc01c2228ebf6814/",
            "video_page_url": "https://www.tiktok.com/@katiekickscancer/video/7182768293793615146",
            "video_path": "sample_data/katiekickscancer/video_content/7182768293793615146.mp4"
        },
        {
            "_id": "7182390348822482218",
            "datestring": "2022-12-28 21:22:57",
            "summary": "\n\nKatie is writing a book, but she is procrastinating. When she opens up the music, the songs get stuck in her head and it is hard to write about cancer. She has set a goal to write 40,000 words in 40 days and is only a thousand words away. She needs to get off the music and get back to writing to reach her goal.",
            "text": " I think it's Katie, and I'm writing a book. I mean, not like right now, because I'm procrastinating. I open up the stop, and all the songs get stuck in my head. Turns out, kinda hard to write about the time the cancer tried to kill you. That song's like a stuck in your head. But you see, I made a goal, tried 40,000 words in 40 days, and I'm only a thousand words away. So close. So what I should do is get off the stop and back to read. So y'all better not hear from me again and tell him at 40,000 words.",
            "timestamp": 1672280577,
            "title": "\n\nKatie is writing a book, but she is procrastinating",
            "user_id": "@katiekickscancer",
            "video_content_url": "https://v16-webapp.tiktok.com/c393799719e3fbfe5104b23dbc7050b5/63d0e162/video/tos/maliva/tos-maliva-ve-0068c799-us/9d170e66dadc4211a26e46ea035b3baf/",
            "video_page_url": "https://www.tiktok.com/@katiekickscancer/video/7182390348822482218",
            "video_path": "sample_data/katiekickscancer/video_content/7182390348822482218.mp4"
        },
        {
            "_id": "7180408344413326635",
            "datestring": "2022-12-23 13:11:55",
            "summary": " worse\n\nThis phrase is often used to express optimism and gratitude in the face of difficult circumstances. It serves to remind the speaker that, regardless of the current situation, it could be worse. This phrase can be used in a variety of situations, from dealing with a small disappointment to coping with a major tragedy. It encourages the speaker to look at the situation from a more positive perspective and to focus on the good things in life.",
            "text": " Oh It's better it could be",
            "timestamp": 1671819115,
            "title": " worse\n\nThis phrase is often used to express optimism and gratitude in the face of difficult circumstances",
            "user_id": "@katiekickscancer",
            "video_content_url": "https://v16-webapp.tiktok.com/133ff7f0feb30ded44ea14aefd584697/63d0e156/video/tos/maliva/tos-maliva-ve-0068c799-us/a3692f7cf8114770ab44d18503923dc2/",
            "video_page_url": "https://www.tiktok.com/@katiekickscancer/video/7180408344413326635",
            "video_path": "sample_data/katiekickscancer/video_content/7180408344413326635.mp4"
        },
        {
            "_id": "7179327150523305262",
            "datestring": "2022-12-20 15:16:09",
            "summary": "\n\nThis is a reflection on the importance of having someone to rely on, even when time has passed. The speaker acknowledges that without the support of this person, they would not have been able to make it through difficult times. The metaphor of a spinning wheel is used to illustrate the feeling of being supported and held up by someone.",
            "text": " even when I know it's been forever, I can still feel the spin I wouldn't have made it if I didn't have you on in my hand.",
            "timestamp": 1671567369,
            "title": "\n\nThis is a reflection on the importance of having someone to rely on, even when time has passed",
            "user_id": "@katiekickscancer",
            "video_content_url": "https://v16-webapp.tiktok.com/41e92913a0b7a1de4b293c15248aa42a/63d0e166/video/tos/maliva/tos-maliva-ve-0068c799-us/f0dd49e601e04800a6a5028b32adea3f/",
            "video_page_url": "https://www.tiktok.com/@katiekickscancer/video/7179327150523305262",
            "video_path": "sample_data/katiekickscancer/video_content/7179327150523305262.mp4"
        },
        {
            "_id": "7177514930738941226",
            "datestring": "2022-12-15 18:03:48",
            "summary": "\n\nThis story is about a person battling stage 4 cancer for over a year and a half. They go to the doctor to get the results, and on the way home they stop for food and encounter a homeless man who is hungry. The story ends with a beautiful rainbow. The story was too long for TikTok, so the person posted it on a different platform, and encouraged viewers to click the link.",
            "text": " Story time. I set the scene for you because I tried to do it in another video. Because I said where that video is at. Shobo! Views plummeted. The algorithm did not like that. So we're here. Let's set the scene. It's the end of October. And I've been battling stage 4 cancer for over a year and a half. Wow. Now it's scandy. We wonder, is it gone? Or has it come back? Only time will tell. I'm restless. Finally in the doctor's office. You get the news. And as I head home, the kids sit down. Stop for food before heading home. The homeless man approaches. He's hungry. We're both soaked. Story ends with a beautiful rainbow. So how'd the rest pin out? A long of a story for TikTok. So I posted it on the red video place, which shall not be named. But you should click the thing in the place that the things go. I don't think I can say the other words.",
            "timestamp": 1671145428,
            "title": "\n\nThis story is about a person battling stage 4 cancer for over a year and a half",
            "user_id": "@katiekickscancer",
            "video_content_url": "https://v16-webapp.tiktok.com/06e3423c05e984a6b4892c22134d7f97/63d0e199/video/tos/maliva/tos-maliva-ve-0068c799-us/6edca90ad3244c2296bc964549ff8dce/",
            "video_page_url": "https://www.tiktok.com/@katiekickscancer/video/7177514930738941226",
            "video_path": "sample_data/katiekickscancer/video_content/7177514930738941226.mp4"
        },
        {
            "_id": "7174978748276591914",
            "datestring": "2022-12-08 22:02:06",
            "summary": "\n\nToday the writer discussed the process of writing a book, which includes sending out query letters to literary agents in order to find someone to act as a middleman between the writer and the publisher. This process can be difficult as literary agents receive many book ideas, so the writer must find a way to stand out. The query letter is an email that describes the story and why the literary agent should work with the writer. Despite the challenge, the writer sent a query letter today and is unsure if it was done correctly.",
            "text": " I said I'd share the process of trying to write a book, so let's talk about what that looked like today. I've hit pause on writing this week because I've been focused on trying to send out query letters for a literary agent. If you don't know what that is, that's cool. I didn't do that, and I had to do a lot of googling. Also got some advice from a few people who've written a book, which is like super helpful. Basically, if you want to go with traditional publishing, you need a middleman to talk to the publisher for you and like pitch your book idea. It might not be a great analogy, but so far to me, they remind me of like the real estate agents of the book world. But unlike finding a real estate agent, it's quite hard to find a literary agent because they have lots of people that send them book ideas. You've got to find a way to stand out. It also means you'll likely send a ton of query letters and not hear back from anybody. We'll get rejected a bunch, which I'm not so fond of, but it's part of the process. So today, I sent a query letter, which is basically just an email describing your story and why they should work with you. I think I don't know if I did it right.",
            "timestamp": 1670554926,
            "title": "\n\nToday the writer discussed the process of writing a book, which includes sending out query letters to literary agents in order to find someone to act as a middleman between the writer and the publisher",
            "user_id": "@katiekickscancer",
            "video_content_url": "https://v16-webapp.tiktok.com/26085fa7ec7555e4e4cf6496418475df/63d0e1be/video/tos/maliva/tos-maliva-ve-0068c799-us/682a4ddaa0774178a2112d26c79ed621/",
            "video_page_url": "https://www.tiktok.com/@katiekickscancer/video/7174978748276591914",
            "video_path": "sample_data/katiekickscancer/video_content/7174978748276591914.mp4"
        },
        {
            "_id": "Js27JwrXsIg",
            "datestring": "2022-12-26 07:24:22",
            "summary": ". So that was kind of the news that came out of that. So I am now officially in a stage four cancer to no active cancer.\n\nAfter being diagnosed with stage 4 cancer, the patient has been working hard to get to a stage of no active cancer. She recently had scans a month and a half ago, and the week before that she took a big trip to California with her best friend. She drove to Houston the morning before her scans and had a pre-scan ritual of moving a rock from the cage rocks to the free rocks. Her husband usually comes with her to scans, but this time he stayed home to take care of the pets. After her scans, she went shopping to distract herself and made gifts for her oncologist and his nurse practitioner. When she went to her appointment, she found out that all the spots they had been watching had stayed stable and there were no new spots. This means she is now officially in a stage 4 cancer to no active cancer.",
            "text": " Stage 4 Cancer to no active cancer. How to get here. And am I here? Let's talk about it. I have had a really hard time making this video. I had my scans a month and a half ago and I have had a hard time sitting down and recording this video for multiple reasons. I've been working on a few things of which I will share and give you guys an update on what I've been doing and working on. But I also have just had a really hard time finding the words and what to say for this video. I'm still like trying to process through it all myself. So we're just going to go for it and see what happens. So last time I made a video was before my last set of scans. I was really nervous and this was the longest period of time we have ever gone between scans for me. We upgraded from three months to four months this time. So my scans were at the end of October. And the week before that I took a big trip. I went to California with my best friend from back home. My husband and I moved down to Texas for MD Anderson when I was diagnosed. We used to live in Utah, which is where all my friends and family still live. And so we planned this trip to go to California and she brought her little boy along and we were able to take him to Disneyland. We took him to the beach. We just had so much fun. So that was a lot of fun and then I flew from LA to San Francisco. And then my husband met up with me in San Francisco and we went to Yosemite to celebrate our anniversary, which was amazing. My scans were about two weeks after I got back from that trip. My husband used to come with me to all of my scans. He wasn't able to come back into the appointments with me and during COVID he wasn't allowed to come in the building at all. Basically we stayed in a hotel that was attached to MD Anderson and he would just stay at the hotel. But the last few times we have gone for scans, he was able to come with. And it also happened to be the only times that I waited like a really a long time to be seen by the doctor. And I am used to waiting for doctors. I'm just part of having cancer. You get used to it. And I don't care how long I have to wait for my doctors. I will wait as long as it takes. I've used to that. I just know how the breast goes. My husband on the other hand, he obviously was not used to that. And the two times that I've waited the longest for the two times that he came with. So we weren't just waiting for like 30 minutes or something like that. It was multiple hours. And so this time we actually had him stay home because it also is hard for us to find pet care. And so he stayed home, took care of the pets and I went to Houston this time. So I drove out to Houston the morning before my scans. And I had scans and labs around like I don't know somewhere between 11 and 1, which is usually when I have scans. And it gives me time to drive in in the morning. So I usually leave first thing in the morning. And then I have this pre-scan ritual that I do before every single scan, which is pretty ridiculous. And I'll give you the backstory on this. I don't remember if I've told this backstory before. So if I have, I'm sorry. I'll try to make it quick. But basically before every scan, before I go get my labs or anything, I always move a rock from the cage rocks, which I'll show here. And I set them free over by the free rocks. And that sounds like the weirdest thing I've done it for every single scan. And so that's like my little superstitious thing. I don't know. It's just a ritual that I do every scan. And so the reason why I picked that up is, I guess I said, when I was first diagnosed, Brian, my husband, wasn't able to come with me to any of my appointments. And so when we first went down to MD Anderson, we flew down. We didn't live here yet. And we flew down just to check it out and see if we wanted to go there for a second opinion. And when we got there, he couldn't come with me to my appointment, but he walked me over. And then we were staying at, it was pretty close, a blocker to away from the place that I had my appointment. So he walked with me from the hotel over to the building for my appointment. And I was so ridiculously nervous and scared for that first appointment that I was trying to make small talk about anything that could distract me. And so we were just walking around long. And I saw this pile of cage rocks that were landscaping cage rocks. And I was making small talk. And I was like, do you think that those cage rocks, ever could jealous of the free rocks that are around the corner? We like, joked around. We're making small talk about that, just anything to not think about the cancer for a minute as we were walking over to the appointment. And he dropped me off at the doors and I went up to my appointment and was like, still nervous as I was waiting there and there I got a text message from him and I opened it up and it was a bit of a rock. He said something like, now the rock doesn't have to be jealous anymore. So he basically, he took one of the cage rocks and he freed it so that it didn't have to be jealous anymore. And that just made me laugh and smile in a time that like I really needed it because I was so nervous and anxious about that. So that has been our ritual at every scan. I'm sure the landscapers hate me, but yeah, so I take a rock from the cage rocks and I walk over and drop it off and put it by the free rocks. Again, the landscaper's probably hate me. I'm sorry, I don't do a lot of bad things or like, we'll break things. That might move the one that I have. Sorry, I have to keep it. All right, so I got too Houston and I did my little move in my rock thing. And I got some labs done and then I waited for my MRI. With back, got my MRI done and then I went to the store afterwards to try to kill some time because my husband wasn't with me. And so I really didn't know how a whole lot to do and I was really trying not to look at my scans. I always open up the app and look at my scans. The report won't be ready, but I can actually see the images. And so I usually will like sit through and like look through every image like you press a little button to see slice, slice, slice, slice. I will torture myself with it all night and it's not fun. And so I went shopping, tried to find some ribbon to tie around some gifts that I made for my oncologist and his nurse practitioner. I think she's a nurse practitioner. Pretty sure. Anyways, so I made them little gifts. I got a laser cutter. So I made some coasters and then I, sure I guess I'll put a picture of those, which was cool. And then I made like a badge holder. It was actually kind of cool. So I gave the coasters to my oncologist and then I made the little badge holder and gave that to my nurse practitioner. And when she came in, so she was like holding her badge as she came in for my actual appointment and she set her badge on the counter. And then when I gave that to her, she told me that she had actually broken her badge that week. So like retractable thing, she'd broken the holder for it. And so it was really cool that like I happened to make this other one and that maybe she could use it. So I thought that was kind of a cool like coincidence. I'm glad that I made that for, I don't know if she actually uses it or not. But anyways, I just thought it'd be nice to make for them. So I made those and I went shopping so that I could buy ribbon to tie them and like actually make them look like a gift instead of just like random things. I did that went shopping and then I went back to the hotel and I had dinner. So I posted something on Twitter mentioning my scans. Basically like, do I look or do I not look? And there was kind of a thread that branched off of that and somebody offered to give me $100 if I waited until the next day to look at my scans. And so I basically messaged them back and was like, if you will actually make that a donation towards a grant for a rare kidney cancer that I try to find that the grant for a chromosome kidney cancer, you've got a deal. And then somebody else doubled down and said the same thing that they would donate if I waited. So apparently I can be bought and I waited until the next morning to look at my scans. It was actually kind of a pretty decent night. I was still nervous of course about the next day and the scans but I actually got a really decent night of sleep. I think I got like eight or nine hours. Which normally like when I look at my scans I only get like a couple hours at best. So it was definitely the right move I think. But the next morning when I went to go look at my scans I hit so anxious. My heart rate just like spikes the minute I opened that app. And I was so nervous to look at my scans. I hadn't eaten anything and I was so nauseous that I literally threw up. That's not happened to me before. But I was just like so nervous to look at these scans. Looked at the scans, got a little worried that like I might have seen one or two new spots and then I couldn't really tell if like other ones grew or not. They looked about the same size to me. It was already sure I kind of looked pretty quickly at them. I wanted to get a general idea like look for anything really big. And then I just decided to wait for the rest for my appointment. Then it came time for my appointment. So I walked over to the building next door to wait for my appointment with my oncologist. And basically the news that came out of that was that all the spots that we had been watching have stayed completely stable. Which is good news. And there was no new spots that appeared at all, which is also good news. So I have been off treatment for over a year and a half as far as like systemic treatment. And then it had been about a little under a year and a half since I had had surgery in a about a whole year since I had ablations to the spots my liver. So this entire year I was able to be on active surveillance, which was amazing. Basically the spots in my liver have been stable so long and they're so small that we haven't like biopsy to them or anything like that to even really know what they are for sure. So it's possible that they might not be cancer at all. So I asked this time. I asked and said like, okay, we've been watching these spots for quite a while. And I've been off treatment and we haven't ever seen any growth in any of these spots. So a lot of these spots were actually there before surgery. They've been on my scans. Like if I go all the way back to when I was first diagnosed, most of these spots are there and they're about all the same size. And so I don't think we've ever seen any growth in these specific spots at all. And so I asked like, what does that mean? Because we don't know these are cancer and they might not be in my no evidence of disease, which like any D or no evidence of disease is like the goal that every patient wants to like get to. It was something that when I was first diagnosed, I was told not to get to a catch too because we didn't ever think that I would be able to reach any D. And so those words have a lot of meaning for me. So I just asked, I asked like, would we consider me any D? And because the spots have stayed stable so long, they mentioned that they wouldn't have a problem calling me any D. That came with stipulations of course, is at the end of the day, those are really just words. They're just words to describe like the current state of my scans. So like based on those scans in particular, you might be able to call me any D. It's actually the first time my scans have not mentioned specifically any lesions. It's suspicious. So like they were kind of my first NED like scan report maybe. I don't know. This is where I have had a hard time making this video. It's because like I just have a hard time processing all of that because we don't know what those spots are. Like I'm really, really hopeful that they're not cancer. And so like as we were discussing, we are comfortable saying these are no evidence of disease scans. But again, those are kind of just words in a way to describe any point in time. It does not mean I'm like cured of cancer. You can't like reach a cured status until you're like years down the road with no reoccurrences. Nothing. They might use the word cure in those scenarios, but definitely not in any sort of stage that I am right now. So the reason I have had a hard time kind of accepting those words or NED, which is something I've wanted for so long that like hearing those words is amazing to hear. But one of the reasons I have had a hard time like processing or accepting that is because if the next set of scans I have or any scans after that show any of those spots ever having any growth, then I technically wouldn't have been NED, no evidence of disease. So I've had kind of a hard time like fully accepting that just because there are so many unknowns. So the term that I like to use a little bit better, which is also a term that my oncologist used is no active cancer. So that was one that we said like at the very least, it's no active cancer. Like we could probably call this no evidence of disease. So at the very least, it's no active cancer. And so I took that as a win. They said literally nothing has changed on my scans. Nothing has changed on my scans in like 10 months. So like since I had my relations, nothing has changed, but time is like the biggest factor there. So it was really important for us to watch me off treatment and see what happened and these things haven't been growing. And so that is amazing news and I am stoked about it. It was kind of crazy and kind of surreal because I got the news and I was processing it all and I was so stoked to just have good scans and finally hear those words for the first time. And we were just trying to celebrate, but I didn't have fire in there with me, which was kind of a bummer. And so I was just celebrating myself. And I literally went out to like they've got this fountain in front of the building. And I went out in front of the fountain and there's a big sign out there too. And I asked the stranger that was walking in the street. I was like, hey, I just got some really good news. Eddie, did you take a picture of me? Right. I asked like a bleat random stranger to take a picture of me because I wanted to document that moment. Like that was a pretty big thing for me. Hand of the day, they're kind of just words. But words can mean a lot sometimes. So it's a great place to be regardless. And I'm very thankful that I'm here. My next set of scans, I think we're going to move from four months to four and a half months. They gave me the option to go all the way up to six months, but I'm like, baby stepping my way up there. Yeah. So overall, it was great news and great scans. It was actually kind of cool. So as I left MD Anderson to go back home, it was pouring rain like torrential downpour. I was leaving and I had to go charge my car. So I went to a Walmart to go charge my car. I went inside to buy something, I think I was grabbing like a few snacks for the drive home. I don't remember what I was grabbing, but I didn't have an umbrella. So I ran it into Walmart, was soaked when I got in there. And then as I was coming back out, I was like running and then I realized like, I am just soaked. And I'm going to be soaked regardless. And like, I was in such a good mood. They like, I didn't care. I like appreciated the fact that I could just be soaked in rain. Like that I was even here for that moment. So I stopped running and I just started walking back to my car and just like laughing to myself about how just completely soaked I was. And as I was walking back, there was this guy that approached me and he like took up very large step back. Like he stayed pretty far away from me and he was like, I'm so sorry, I know I should never approach a woman. He basically was saying like, I'm not asking for money or anything. We're just wondering if you had any food or anything like that. Like, I'm kind of hungry and just trying to be able to get downtown. Kind of make his way downtown to get to like services. He seemed very genuine and I felt like I just got some amazing news and I really wanted to pay it forward. So I like, I think I had like a bag of cheetos in my bag, but he was hungry and like soaked, head to toe. And so I thought he might appreciate like a warm meal or something better than my little bag of cheetos. And so I know this was not the smartest decision to make. It was not like the safest thing, but I just, I got good news and I really wanted to like pay that forward to somebody else. So I basically told him like, so there's like, there was a cafe that was like across the bar being lot. And so I just asked him like, I do want to like, I can go buy you a sandwich from over here if you'd like. So I basically asked him if he wanted to go to the cafe and I could buy him something and he was so so appreciative. And I think he was kind of shocked and like take it back the fact that like I offered to go buy him a full meal. And so he was like, so grateful and we started walking over there and he was like, are you going to go on foot? It's pouring rain. We're so we're soaked. And I was like, yeah, like I'm already wet. Let's just walk across the parking lot. So he started walking over there and he like brought in his shoulders and was like, okay, I'll protect you. It was kind of a funny moment because we were both walking over there and it was kind of what it was like. I knew he was like so grateful that I was like even walking over there with him. It was like his way of like trying to help pay back and like make sure he can be safe while they walked over there. But I mean, I was like walking with the straight grass parking lot, which is something that I think both of us realized like, was it exactly the same thing? But I like, I appreciated that. It was pretty funny. So as we were walking over there, he was just so grateful and he was thanking me. And we were kind of just talking as we walked in. I basically told him like, of course, like I'm happy to help. I got some really great news today and I'm just happy to pay forward. And so he was like, well, what good news did you get? So I shared with him the fact that I had been battling stage 4 cancer for the last two years and that when I was first diagnosed, like treatment wasn't meant to be curative and my prognosis didn't look real great. And so the fact that I was here was like pretty monumental for me. And so that news was amazing news. And then I shared with him like the surgery and treatments and everything like that that I had been on. And he was like so excited for me too as we were walking over there and he was like, man, that's so cool. Like you've kicked cancer's ass. And he was just like hyping me up the whole way. So once we got there, I went in and ordered him food. He waited outside because he didn't think that they would let him in. I walked in and I was completely soaked. My makeup was like all over the place. But I ordered him like a nice orange sandwich, chips drink, you know, just like a combo meal. So I gave him his food and he was super grateful. And as I was leaving and walking away, he was like, I'll never forget you Katie. The girl kicked cancer's ass. And it just made me laugh as I like walked back my car. I guess I thought that probably was the safest thing to do. It was just nice to be able to like share and make somebody else's day better after I had had a pretty good day myself. Actually, the coolest part of it all is once I got back to my car, I got in my car and kind of got situated. And then I looked up and I saw this full rainbow. It was the one beautiful thing. It was like in the background of a Walmart parking lot that is not the most beautiful thing. But the rainbow was like incredible. And that was just like the cherry topper on the day to be able to like have that whole experience, get the scans that I had and then like come back and see this really beautiful rainbow. Yeah, I don't know. It was just like a really cool experience all in all. Great day. 10 out of 10 would recommend that day again. So that's my news. That's where I'm at. Like I said, I would probably like to say that I have no active cancer. I am more attached to that term than I am to any do. I feel like it is incredible that we can even use that phrase with my current state. But in case you saw me post about no evidence of disease and now you hear me say no active cancer, they're really just words. And yeah, I'm too scared to use no evidence of disease and no active cancer feels less scary. By the way, I want to be no evidence of disease. I want to make it to that cancer pre status one day and hopefully we can. I'll try to keep you guys updated. I might even start posting a few videos here soon sharing kind of what else I'm working on. So there's two other big things that I have kind of been working on the last couple months. One of them is I am in the process of starting a nonprofit. It is for chromafob kidney cancer and oncocytic tumors. I am starting this nonprofit so that I can kind of help continue to help move research forward for chromafob kidney cancer and tumors like mine, like metastatic oncocyteomas. They are very under researched and need funding to move things forward. Actually with a few other wonderful ladies helped raise the money for the first ever chromafob kidney cancer grant that was put on through KC care. We raised that money last year. We raised $50,000 specifically for research on chromafob kidney cancer and that really kind of helped get more people interested in studying chromafob kidney cancer and kind of helped level it up a little bit. And they are continuing on with that grant and I've contributed fundraisers for that grant as well as donated towards that grant myself. But I have decided to start a nonprofit specifically for chromafob kidney cancer and oncocytic tumors to help elevate it a little bit more. When you have organizations sometimes that are more focused to like a very specific type of cancer, it can sometimes that can help elevate that specific type a little bit more because you're putting all your efforts into that one focus and cause. So I have held off on creating a nonprofit or anything like that because I never wanted to take away from any of the other ones that exist. But I realized that I'm not taking anything away from those other organizations. They're organizations that I fully support and plan to continue to support. They're doing great and amazing things. But I am just creating this new foundation to help elevate chromafob kidney cancer specifically. And see if I can help solve some problems there. So I've been starting that nonprofit is one of the things I've been working on. The other thing I've been working on is I have been writing a memoir which takes a long time. I'm like maybe 40, 45,000 words in at this point, which might be close to halfway. Basically I'm writing a memoir about my entire journey and everything that I've experienced battling this cancer. And I have no idea if I'll ever be able to find a literary agent or find anybody to help me publish it. I'll probably self publish if I can't find a literary agent or anyone interested. But basically plan to write this memoir and I'm going to try to sell it to help raise money for chromafob kidney cancer as well. So those two kind of feed in to each other. And I might start posting videos of that process of what it's like to write a memoir because just like I didn't know what it was like to battle the toward cancer, I also don't know what it's like to write a memoir. So I've been documenting the process as I go. So I might take you guys along with me for a few of those videos as we're in between scams and I don't really have a whole lot of other eventful things happening. So that is the update. Thank you again for sticking around and I will keep you posted with any news that come soon. And in the meantime, let's celebrate the good news and good results. Hope everybody has a happy holidays.",
            "timestamp": 1672057462,
            "title": "",
            "user_id": "@katiekickscancer",
            "video_content_url": "",
            "video_page_url": "https://www.youtube.com/watch?v=Js27JwrXsIg",
            "video_path": "sample_data/katiekickscancer/video_content/Js27JwrXsIg.mp4"
        },
        {
            "_id": "92Da-XC-7dk",
            "datestring": "2022-11-26 07:24:22",
            "summary": " part, it's open. So you can see out and you can see the techs, but it's kind of like a dome that goes over top of you. And then they will start the scan and you will hear a lot of loud noises. So I've heard people say it's like a jackhammer, it's like a train, it's like a loud fan, it's like a loud vacuum cleaner. I mean, it's really loud. And so they will typically give you headphones or earplugs. I actually prefer to just put my hands over my ears because I find that it's a little bit more comfortable for me. And so that's what I usually do. \n\nThis video is about the experience of going for scans for those with stage four kidney cancer. The author goes into detail about the difference between a CT scan and an MRI, including the contrast used and the sensations felt. They also explain that CT scans are typically quicker and that MRIs are louder and require headphones or earplugs. The author also explains that a full body CT scan does not include the head or lower extremities, and that drinking a lot of water after a CT scan is recommended.",
            "text": " It's a breathing, breathe out, hold. And then I feel like I'm cheating because I hold like a tiny little bit of breath. So I was going to share my skin results in this video, but as I tried to record the other night and I was giving updates on my skin results and kind of taking everybody through the process and me going through my skin, I realized that I could probably break this video up into a couple videos that might be a little bit more helpful to people. The purpose of this channel originally started to help people find information that I was once looking for when I was first diagnosed. So I will stick to that for this video and then I will make another video where I'm going to actually show a little bit more in detail my skin. I will show kind of what the skin's used to look like, what they look like now. And then I will make a separate video where I give my update. And so I apologize. I'm not trying to show you guys along. I just really want these to be more tactical videos that somebody else might see benefit out of. I didn't really know what to expect for a scan day or anything like that before I was diagnosed. So maybe this will help somebody else. So let's just dive into it and let's talk about scans. I of course am not medically trained in any way, shape or form, but I thought I'd just share some of the information that I've learned over time through my diagnosis and some of the questions that I had along the way. So let's start with what type of scans that I am currently getting. So I currently go for an MRI. We do an abdomen and pelvis MRI every three to four months. And then I do a chest CT about once a year. My scan schedule is a little bit different than some other patients with stage four kidney cancer. And part of that is to do with the fact that we're mostly concerned with my liver, which is why I get MRIs instead of CT scans. MRIs have a little bit better imaging of the liver and allow us to get a better look at everything that's happening there. And that's our main concern and location, which is why we have me doing MRIs. Other patients often also get a chest CT more frequently than I do. The reason why we are not doing chest CTs as frequently for me is because we're not as concerned about it going to my lungs. We still are definitely watching because it could be a possibility but I think there might be one case report of a oncosytoma, which is what I have, a really, really, really rare type of kidney cancer, metastatic oncosytoma, which is like super, super, super rare. But there aren't really very many case reports of it going to the lungs. The liver is typically the main site that there's case reports in and sometimes bone. We are still keeping an eye on my lungs but we're not scanning as frequently as other patients typically get scanned when they have kidney cancers. All right, so those are the type of scans that I get. The other thing that I'm going to cover is what the difference is as far as a experience perspective between a CT scan and an MRI. Because they are quite a bit different. And this is something that I didn't have any information of. I just heard how much people were worried about scans. I was scared they were, especially MRIs. I heard a lot of people talk about how frightening MRIs were and that they were claustrophobic and just really, really struggled with MRIs. I'm the really weird person that I would prefer an MRI any day over a CT scan. I haven't really met anybody else who prefers that as well but MRIs are easier for me. And so I would rather go for an MRI. But I would not always hear the opposite from everybody else and it always freaked me out. So before I got one, I ended up coming on YouTube here and I would look for what MRI sounds were because everybody told me they sound scary. So we'll talk through all that. But basically a CT scan typically is a lot quicker of a process and a scan to go through. So what usually happens if you're gonna go for a CT, it can vary depending on the scenario that you get the CT. So for example, when I got my very first CT scans when I was in the ER, I didn't have any like oral contrast, I drank or anything like that. All they did is they started an IV and then they pushed the contrast through the IV. If you go for just like regular surveillance scans, oftentimes they'll have you drink a oral contrast which is different from the contrast that you might see people drink from like PET scans. It's not that like smoothie drink. It's a clear liquid and you can mix it in with other things. I usually just drink it with water and I can't really taste it that much. But when I do that scan, basically I have to drink about 32 ounces of the liquid, about 45 minutes before my scan. There's a little bit more waiting up front. But once you get back to the scans, it's pretty quick. You've got a big machine, it looks like this. This is one of the machines at MD Anderson. Then they'll flush your IV and then hook it up to the machine so that it can push in the contrast. And then they will leave the room. They'll be able to talk to you through the speakers. My very first CT scan, I was super, super nervous and super scared and I really appreciated the tech talk to me the entire time and made sure that I was calm. I mean, I definitely was not calm, but he tried to keep me calm and I really appreciated it. Typically if they're doing with and without contrast, they'll take the images before the contrast goes in. So you'll lay there as they take those images and then they will push the contrast through. They'll usually let you know before they do that so that you can be prepared for it. And that is what is different for me about a MRI and a CT scan other than the amount of time it takes is the contrast. I am not a big fan of the contrast. A lot of people get the sensation like they're going to pee their pants, which I do a little bit but more than anything else, it really warms and kind of makes the center of my chest burn. It's not painful or anything, it's just very uncomfortable. And so I don't typically like CT scans for that but it passes very, very quickly. So I wouldn't say like that's something to be scared of at all. Honestly, like getting your IV placed can be more stressful than a CT scan at times. And so the process itself is not painful or anything like that. It just, I'm not a big fan of that sensation. So basically once they put the contrast through, you'll feel it move throughout your body and then they'll take some more imaging. They might have you do some breath holes through the different imaging as well. That basically helps you keep holding still and they can get some good images. And then it's all over pretty quick. A CT scan, I mean, I don't know the exact duration of it but it usually feels like it's under 10 minutes. I don't know, it's a pretty quick process. Would you actually get on the bed, the machine started, it all goes by pretty quickly. And so that is what a CT scan has been like for me. One of the other things that I always wondered about CT scans is like, where do they scan? So oftentimes I would be scheduled for a full body CT scan and I always thought that that meant literally full body. So we're going head to a toe. But I've found sometimes when it's called a full body CT scan, what it really means is it's chest, abdomen and pelvis. So it's like the middle chunk of your body. It does not include like your head or your lower extremities. So that is something that I wondered. So after CT scan, you're supposed to drink a lot of water to try to help flush everything out of your system. And then that's it. You're pretty much good to go after you've wrapped up with the imaging and they will get results. It varies depending on where you're at. Sometimes the results come back the same day. Other places it might be a few days. So all right, now let's talk about an MRI scan. So what is the experience going for an MRI? So I have had a couple MRIs. I have had a MRI of my brain and I've had an MRI of my abdomen and my pelvis. So the MRI machines look very similar to a CT scanner. Both the CT and the MRI, they will likely have you change into like the scrubs. Here's a couple photos to go back with an MRI. It's really important that you don't have any metal on you. So they almost always have you change into it. CT scan sometimes you might be in other things. So like I was in a hospital gown for one of my CTs. But oftentimes they'll just give you scrubs to change into for that. As far as the MRI goes, MRIs do take longer, actually in the machine. But I don't drink contrast or anything like that beforehand. So overall it's kind of close to the same amount of time. But you spend more time in the actual machine. So the more body parts are scanning the longer it takes. When I get an abdomen and pelvis, it takes a little bit longer than just when I do just abdomen. But overall I'm usually in the machine for about 30 to 45 minutes. And that is usually for the abdomen and pelvis. I think when I did my MRI, I can't remember for certain that I want to say it was in that like 30 to 45 minute window as well. And for that one, that one was a little bit more stressful for me. Basically what you do when you go for an MRI, you do a very similar experience of you get your IV placed. You change into your scrubs. They'll have you walk up to this thing that's going to detect if you have any metal on you. You do a little spin. Make sure you don't have any metal on you as you're going in because these are basically gigantic powerful magnets. And then you go back into the room and you will lay on the bed just like you do for a CT scan. They will flush your IV and then hook you up to the machine for the contrast. And the contrast is different between an MRI and a CT scan. So in MRI, you don't get that like warming body sensation that you get with the CT. I honestly never really feel the MRI. It sometimes is like maybe a little bit cold, but I don't ever really feel or notice the contrast from the MRI. And what's different about an MRI is after you lay down and you get settled, they will lay something over top of you. It's how you capture the images. For the most part, it kind of just sits on top of you. It's not pressing hard, it's not heavy. It kind of just sits there so that it can capture the images. When I went for my brain MRI, I obviously did not have that on my abdomen. Instead, it goes around your head. And that is the one that was a little bit more stressful for me because it kind of goes all around your head and can't really see a whole lot out of there and you're kind of be at the whole drill still and not move. And so that one was a little bit stressful, but I still got through it just fine. And after you lay down on the bed, after they've secured the camera, they will give you a little squishy ball. This is the basically like help on panicking ball. It's there in case you get claustrophobic or if you freak out and you need to talk to them, it's there to notify them. So they can stop the scan and help you with anything that you need. They will also put on some type of headphones or earplugs sometimes both because the machine is very, very loud. That is what a lot of other people talk about of like the machine is kind of big and scary, makes all these loud noises. It does make a lot of strange noises. It's magnets that are spinning around really quickly. And so the headphones and the earplugs are to make it so that is not so loud for you while you're in there. And one of the things that I learned very early on from another patient, which I really appreciated, is you can usually ask them to play music. So I listen to music with every single MRI that I have done. And it really helps distract me from everything that's going on. It makes it a little bit easier of a process for me. So I highly recommend listening to music if you want to while you're in there for me. I made a hard and fast rule of, I will never listen to my favorite songs while I'm in there because I do not want to associate those memories with that machine. So a couple of things I've listened to when I'm in the MRIs. I've listened to soundtracks of movies. So I really like Hamilton. I know I just said don't listen to things you like, but it's a little bit different for me for that one. It's not something I'm just like listening to on a daily basis. And so I got diagnosed around the time Hamilton came out and I was listening to the Hamilton soundtrack. So I have listened to the Hamilton soundtracks several times while I'm in the MRI machine. And I've made that request a couple times for me that helps because it's something that I've seen. So I'll be listening and I'll like visually be picturing what's going on and it's really good distraction for me. So if you like any movie soundtracks or musicals or anything like that, I highly would recommend that. It's been helpful for me. And then sometimes I've just asked for just like general with radio stations and this last time they put on spa music, which honestly kind of put me to sleep. But yeah, so you can definitely make a request to ask for music to be played. You have to make sure that you can still hear their instructions. So it's always important to like double check and confirm that before you go back because that is the other thing is as you're going through the MRI. It is a long scan and you will likely have breathing instructions throughout. And so you need to make sure that you can hear the instructions as you go, otherwise it'll make your scan longer and it can also ruin the quality of the images. So it's really important that you can hear them throughout the process. All right, so now you've got your headphones on, you've got your music going, you've got your little squeezy ball. So from there they've got you all set and they will head out of the room and start the scan. It'll take you into the machine and then you will start hearing the noises. This is something that I highly recommend to listen to beforehand if you want to. This helped me a lot in knowing what to expect. You're literally just YouTube MRI sounds and you can hear what it sounds like. And that helped me be prepared for the MRI. So I knew what the sounds were going to sound like once I got back there. The other thing that has helped me is, I said I usually listen to some type of music and listening to those musicals, what I would do is I would lay there and I picture the sounds is like drums or something. I'd like try to make a pattern or something like that with the noises that the machine was making. Something to distract me from like the actual scan that was going on and put it into a different context. I don't know if that will help with anybody else, but that's just something that I do to help get me through it. So once you're in there and the scan starts, I'll go through and they'll just start taking all their images. You will slowly kind of move back and forth through the machine as they're kind of moving you into different locations to take the images. And especially for me and my liver and the abdomen, I have lots of breath hold. So they will basically say, we have a breath hold coming up and it'll always say, breathe in, breathe out, hold. And basically you hold your breath while they take a bunch of images and you want to hold very still while you're doing that and try to be consistent with the amount of error that you're letting out. This is one thing that I, I still don't know if I get it right every time. They're just breathing instructions. You wouldn't think that they're that difficult, but whatever they tell me, breathe in, I breathe in really deep and I breathe out. And then I feel like I'm cheating because I hold like a tiny little bit of breath left because I, I'm not sure I'm gonna make it with the exhaling all my air. I know that's not an actual thing, but I just get it second my head. But the biggest thing with that is just being consistent. So I don't know the right amount of error you're supposed to excel. I will pretend that I do. The biggest thing I've asked about this before is just make sure you're consistent and make sure you're holding really still and holding your breath when it says to hold your breath. If I have several breath holds, they'll do all my images with those before the contrast and then I get the contrast. Again, I don't really feel the contrast from an MRI. Sometimes it might be a little bit cold, but I don't really feel anything. And then we'll do the same thing with the contrast. The contrast is usually the last like 10 minutes or so. So the bulk of the scan is usually already done and it's just like the last 10 to 15 minutes is the contrast portion. So that's usually when I know that we're about to wrap things up and I just get through those final breath holds. And once I'm done with that, the tech comes back in and you're ready to go. So same thing, you want to drink a lot of water to flush everything out of your system. But then they'll evaluate your images, push out your report and let you know. Reports again, it kind of depends on how quickly that a radiologist can read the scans. For me, I've had scan results as soon as a few hours and then other times it's taken a couple days. So kind of just depends on where you get your scans done and how busy they are. So I don't know if that's helpful, but hopefully it is that is kind of what my experience has been with ACT scan and an MRI. Both of them I was much more worried about before I actually had several of them done. They can be pretty stressful, especially those first ones that you go through. It's a whole process about waiting for your scans and the results that I really struggle with these days. But the scans themselves aren't too bad. What else here? The other difference between a CT scan and an MRI is that with a CT scan, you are, I suppose, with a small amount of radiation. But if your doctor has ordered a CT scan, that means that they think the benefits outweigh the risk. So you definitely want to still make sure that you get that scan taken care of so that they can check everything out and know what's going on. I'll say I really, really, really worried about the amount of radiation that I had when I was first going through my scans. I heard people talk over and over and over again about how dangerous CT scans are. That honestly was part of the reason why it took me so long to be diagnosed is because nobody wanted to scan me because my age and they didn't want to expose me to the radiation. But scans are a very critical part of care, especially when you are a CH4 patient, so it's really important to make sure that you're staying up to date on your scans and getting those when you need to. The other thing is I had heard about how bad radiation is for you and I thought that that meant, again, I had no medical knowledge at all when I was first diagnosed. And so all I had to go off of is information that I heard from other people. And so when I heard the radiation causes cancer and all of that, it was a great, already half cancer, like I'm terrified, does this mean my cancer's gonna grow faster? Doesn't mean I'm gonna get another cancer super soon. We're being something that I was really worried and afraid of. But with radiation from CT scans, basically the amounts that you get from just one CT scan is relatively low. You still want to keep track of all the scans that you get and make sure that your doctors are aware of how many scans that you've had. But the radiation exposure that you get from a CT scan isn't going to give you cancer tomorrow next week, next month, anything like that. And it's not something that they can predict super well. A lot of the information that they have on radiation exposure actually comes from the data and research from exposure to the nuclear bombs. But like I said, if you go for a scan, you're not gonna be developing cancer tomorrow. And especially a small number of scans, your risk is still very low. And so always make sure you're talking to your doctor about these things. It's very important that I thought I'd just share that information because it was something that I'm really, really worried about when I first diagnosed. I already had cancer. I really did not want another cancer. And I didn't know how any of it worked. I thought if I was exposed to radiation, I could just get cancer like that and I would have that cancer tomorrow. Which is not the case and it's not how it works. Doctors know what they're doing and they will keep you safe. Which kind of brings me back to the other thing that I wondered about when I first got diagnosed. I was wondering about how frequently do you get scanned? But like I said, I am not medically trained or anything like that. So I'm definitely not giving any advice here. But these were some of the questions that I had when I first was diagnosed. So I did not know how fast my cancer was growing. Nobody did. But I was terrified that from when I went from when we found it in the ER to those very first appointments and everything, I thought it was probably just growing like crazy. I didn't realize that this thing had probably been growing in my body for years, if not a decade or more. And so I was petrified and I thought I need to be scanned very frequently. Now my cancer has grown slower than some other people's cancer does. But basically your doctor will put you on a scan schedule that is appropriate for your disease. So in kidney cancer, the scan schedule oftentimes is every three months. And basically they will scan you every three months to do restaging and to evaluate if you are going to stay on treatment or just continue and try something else. When I was first diagnosed, I know I was really worried about being put on a three month scan schedule. And I almost even signed up for a clinical trial that was going to be on a six week scan schedule because I thought it would be better to keep a closer eye on things every six weeks. But that definitely was not necessary in my case. And there are sometimes some negatives to scanning too frequently, which is something that I did not know at the times. So I will use my case and give you an example of what that might look like sometimes. So for example, I got scanned right before surgery when we went in and we took out my right kidney. We cut out several sections of my liver and did a bunch of oblations. It was a very big procedure. And oftentimes after you have surgery for an infractomy, it can vary for everybody. But oftentimes, they'll scan you about two to three months afterwards. And that's usually to make sure that your body has time to heal and that they can make sure that when they go back and look at the scans, they can be certain of what they're looking at. So for example, when we scan to me, we scan only one month after my surgery. And basically, when you scan that soon, there's still a whole bunch of healing and a whole bunch of stuff that's going on from surgery in there. So there can be artifacts from surgery or different things that appear on the scan that may or may not be something that needs to be addressed. And it can be difficult for them to tease out the difference when they scan that soon after surgery. Sure, it varies from patient to patient. But that might be a reason that they might not scan you immediately after surgery. For me, we had seen a few spots that looked like they were missed, but we weren't sure if they were artifacts or not. And then we reskanned me about two months after that. And we did see that a few of those spots were growing. They grew one to two millimeters. But we had missed those spots. So we went back and we ablated them afterwards. Since then, I have been on active surveillance, which means I just go for scans. I am not on treatment at all. And we just scan me every three to four months to see how everything looks and make sure things aren't growing. And in my case, in particular, my disease has grown so slowly or at least up until this point that it's very, very, very difficult to actually figure out if something is growing or not. An example of a downside to scanning too often, in my case, for example, is if we're scanning every one to two months or even sometimes every three months, the growth might be so minimal that it's really, really hard to pick up on a scan. So to give you an example, here is an image of one of my scans. And basically, how they measure the tumors is the radiologist has a program that they click. And they drag from one of those areas over into the other area. And they manually draw to measure what the distance is and how big that lesion is. And with really, really small things, if you move even just a pixel on the screen, it might change the size there. With the larger ones, it can be difficult to get the exact same line every single time. So your scans can vary by a couple of millimeters in those measurements. They're not like a perfect science or anything. So for someone like me, if I scan too frequently, it can be really difficult to figure out, okay, is that just a variation in measurement or is that spot actually growing? The longer I go in between scans, in my case, helps kind of differentiate between just a very small amount of growth and growth that is actually happening. I will caveat that and say that my case is very rare and unique. And so that is just the management plan for me. But I thought I would share that information in case it might be beneficial for anybody else because there's something I really worried about early in my diagnosis as I wanted to be scanned all the time so that we knew what was going on. Well, other examples might be if you have started a new treatment and you scan too soon before the drug has really been able to go into your system and do its job, you might see progression or you might not see shrinkage that could lead to you coming off that drug prematurely. If that drug would have responded if you had scanned maybe like six weeks later or something like that. It's really important to trust your doctors. They'll make sure that you are set up on a scan schedule that is appropriate for your disease and the treatments that you're on. I thought I'd just share that information because those are questions that I had when I was going through my diagnosis. All right, and I guess I'll wrap it up here. I was gonna take you through my scan day of the latest scans that I just had, but I'll make a separate video of that. I will put that in the one that I am actually sharing my results because this video got too long and I wanna make sure that this stays tactical and I hope this information is helpful for other patients. So stay tuned and I'll post those other videos hopefully here soon. Like, subscribe, do the things. I don't know where to point, but all right. Thanks everybody, see ya.",
            "timestamp": 1669465462,
            "title": " part, it's open",
            "user_id": "@katiekickscancer",
            "video_content_url": "",
            "video_page_url": "https://www.youtube.com/watch?v=92Da-XC-7dk",
            "video_path": "sample_data/katiekickscancer/video_content/92Da-XC-7dk.mp4"
        },
        {
            "_id": "xu6uv0aGTCY",
            "datestring": "2022-11-16 07:24:22",
            "summary": "\n\nAfter a long absence from posting, Katie provides an update about her health journey over the last eight months. She decided to use her skills as a software developer in the healthcare or digital health space and went part-time at work to focus on building an app to help other patients like her. She eventually got a message from a recruiter on LinkedIn and transitioned into a new job at the end of April. Katie has been feeling great and has had several clear scans since January. She recently took a big trip to Southern Utah with some cancer buddies and is now pushing her scans out further. Katie is nervous about her upcoming scans but is feeling grateful for the time she has had off of treatment and hopes it can continue.",
            "text": " Hey folks, it has been a little while since I've updated and I apologize. It's kind of a go-in here. We have moved. Somehow this video. It's been a long time since I posted and I apologize. I've had people in the comments asking how I've been and I have been doing a lot more intake talk lately and haven't been making a lot of YouTube videos. And you definitely all deserve an update. So, alright, things have happened in the last eight months. So, I don't think I had talked about it yet when I posted my last videos because I was taking more of a practical approach more than a vlog approach to my videos. But after I had gone through my last set of ablations and starting the new year, I had decided that I really wanted to use my skills as a software developer in the healthcare or digital health space. I knew that I wanted to make an impact for other patients and do something that was a little bit more fulfilling with my skills. So, I decided that I wanted to make a bit of an industry pivot. I wasn't motor sports before and I've been in motor sports my entire career which was about 15 years. But the next few years will probably be pretty important in deciding what route this thing's going to take. And so, I decided that I really wanted to take my time and make sure that I was pursuing something that I was passionate about. So, I had gone part time at work to continue working on the app that I was building. I started to build an app to help other patients like me and to help myself organize my care. One of the things that was really, really frustrating to me as a patient with a wear cancer is the fact that I had so many doctors and all of them used a different system. So, my records did not easily transfer from one place to another. I couldn't see my lab work in both places and it was really hard to keep track of all my doctors, my appointments, my notes, everything. There wasn't a place to keep track of it all in one place. So, I built an app that allowed me to keep track of all my doctors, all my prescriptions, all my appointments and also like vitals and health details so that I could just go back to that app anytime that I had an appointment or that I wanted to make a record of something. So, I had really found my passion in building that app and definitely found that I wanted to kind of move into the healthcare space. And I actually was working on that app when I was going through my ablation so that I was getting done last November. Here's a photo of me that are really working on the app in the hospital. I was frantically working on that thing so that I could get it published in the app store before I went through that procedure. Because the last time that I had gone under anesthesia and I had my surgery, I had brain fog for like a month and I was worried that when I woke back up from the procedure, I wasn't going to be able to work on the app. So, I tried to get that out and thankfully I did get that out. I had published it like literally a day or two before I ended up in the hospital. So, I found my passion in creating that app and I decided to go part-time at work so I could spend more time on building that app and then building patient materials, content, things that might be able to help other patients or things that I was looking for when I was first diagnosed. It's kind of what this whole YouTube channel was about and my TikTok, my Instagram, all the different platforms that I share on. That's where a lot of those efforts were aimed. And I did that for a few months until one day I got a message from a recruiter on LinkedIn and I never ever reply to recruiters on LinkedIn. I get them all the time. I'm trying to get my own horn. It's a thing that fall software developers get. They use get tons of recruiters in your inbox. But I never have responded to one but I randomly decided to respond to this one. I thought I'd pretty much just be saying thanks but no thanks. I was really only interested in any positions if they happen to be in the healthcare space. That was the only way that I was going to kind of entertain any positions. And they let me know that that's kind of the space that this was in. So they were hiring for software engineers for a company that connects health experts with digital health companies that are building their products to help ensure that they're building the right thing. Which was something that I was super interested in because that was something that I actually had a need for myself. As I've been working on my amp and a couple other apps that I was thinking about developing, I kept reaching out to my oncologist or doctor that I had met even over Twitter to ask some questions about what I was building and if it would be useful. And first I felt bad asking those questions because I knew I was taking up their time. But I knew if I wanted to build a product in healthcare, I needed advice from healthcare professionals. And so I just completely saw the vision for this company and I definitely wanted to be a part of it. I will tell a full story of how I went through that process and how I transitioned jobs. I went from a job that I had been at for the last eight years into this new position. And it was the first time I had interviewed for a software developer job even though I was already a software developer. But I transitioned into the role that I previously had and never interviewed. So I will make a separate video on what that entire process was like. And there were a few crazy things that came out of it. I had a TikTok video and a tweet that went a little viral about it. And a bunch of cool things kind of kicked off from there. So that whole process happened kind of in the April May timeframe. I started the new job at the end of April. And so I've been there for about six months now. And it's been great. I've also been working on my own apps on the nights and weekends. I'm currently building a clinical trials app to make it easier to store through and save clinical trials. I'm doing that at my own pace. And yeah, so that felt pretty rambly again. Just the theme of my videos. Thank you, everybody, who has been asking how I've been. I have been feeling fantastic, which I feel so, so, so grateful for. It is mind blowing to me just how lucky I am to be in the position that I am. So scan updates and health updates that have happened over the last eight, nine months. Thankfully, it's been rather uneventful. And hopefully it stays that way. I have scans coming up on Thursday. And I have an appointment with my oncologist on Friday. I'm nervous about these scans. These are the longest I've ever gone without scans. We pushed my scans out another month further. The scans looked good. So fingers crossed. These ones do too. So kind of I'll recap my medical history from the beginning of this year. So at the beginning of January, we rescanned me after we had done my ablations. It was about two and a half months after we ablated a few more spots in my liver that were left behind after surgery. But I still was not on any systemic treatment. We just did the ablations and then we were watching and waiting until January. See if we were able to ablate everything. When we rescanned in January, it looked like we got most of the spots. There were two little spots that we targeted that we weren't really quite sure if we got or we missed. It looks like they were mistoring the initial surgery as well too. So they might be in kind of a difficult location to get. But they hadn't grown and we were still going to watch them to see if we had gotten them or not. It wasn't 100% clear. So I had those scans in January. The next set of scans I believe were at the very, very beginning of April. Those scans thankfully didn't show any growth or any new spots that we could see. So I had my scans in April and then we pushed my next scans out until the very end of June, which would have been my next kind of three months scan. And those scans happened the day after the one year anniversary of my surgery, which was kind of cool that they light up that way. I took a big trip to Southern Utah, which I'll also mean to talk about in another video and include videos and pictures from. I went to Southern Utah with a few of my cancer buddies that I have met online. And they met up with me. I flew to Vegas with my husband and we kayaked and did a few things in Vegas before he flew home and my friends flew in. And we hiked through some of the canyons, we went to Zion, we just had a good time celebrating before my scans. So that was a really nice trip to have. It was kind of an incredible milestone to have gone from place where I didn't really feel well enough to do that before surgery and certainly not after surgery. And so it felt amazing to one year later to be able to be hiking and out and doing kind of very physical activities a year later and feeling amazing and being able to see just how far I came. So I felt incredibly fortunate for that and really enjoyed that trip and had a lot of fun. Alright, what else? Okay, so after those scans came back clear, they decided that we could start trying to push out on scans a little bit further, which I was super nervous about. Scans in June was the first time that I had gone a full three months I think for scans. All the other ones or maybe the April ones were, but it was pretty recent because I either had a surgery or procedure or new treatment. Something that I'd always made it so I got scanned before three months. And so it like I was over a year in Thai diagnosis before I first got that sequence of three months scans. And so pushing to four months, maybe really nervous, especially because we did find out that we do think that they missed a couple of those spots that they targeted in my liver. We don't have biopsies of any of those spots and they've stayed stable so they can't confirm that they're tumors, but they suspect that they might be. And so that's extremely nerve-wracking for me because I'm always worried like are any of those spots going to grow? Are there going to be any new spots? And it's something I worry about every single scan. I feel very, very grateful that they've been stable up until this point and I've got like all my fingers and toes crossed that they will stay stable for my next set of scans coming up at the end of the week. I just, I keep saying after like the next set of scans, it'll get easier, the next set of scans, it'll get easier and it does get a little easier. Each set of scans I go through, but I'm still just waiting for the next one and I get really nervous. I feel like, I don't know, I'm going to change my mind at the next scan so I'm sure. But I just feel like if I get a clear set of scans on the scan and everything is stable, then it'll almost be like it's been stable for an entire year and that without any treatment and that feels like a major win and success. And so I'm really, really, really hoping I get that news coming to the end of the week. We also just moved into a new house and I don't know, I'm really enjoying life right now. So I just want it to stay how it is and I don't want to add to get back on treatment or anything. So I am very nervous about my scans coming up, but I feel very, very grateful for this time that I've had off of treatment and I just really hope that that gets to continue. So I'll make a few other videos hopefully here soon to talk about everything that I've been doing since I last post videos and I will try to make a few updates there. I will try not to be such a stranger here. I'm going to make more of an effort to try to make YouTube videos. So thank you everybody for watching. I apologize that I disappeared for so long. Being a disappearing act isn't necessarily the best thing for a patient sharing their cancer journey online. So I'm sorry, I'm still alive. I'm still here. I'm feeling great. So thank you for all the support and love and for checking out these videos. Feel free to follow me on my other channels as well. I have a TikTok that's Katie Kicks Cancer and I'm an Instagram as well, which is Katie Kicks Cancer. I post on those platforms a lot more often than I post on YouTube, but I'm hoping to get back to YouTube videos and edit this stuff here again soon. So thank you and have a good night. Like or subscribe or something. I don't remember. It's been so long since I've done this and I didn't ever have it down in the first place. Do the like and subscribe thing. I think. Bye guys.",
            "timestamp": 1668601462,
            "title": "\n\nAfter a long absence from posting, Katie provides an update about her health journey over the last eight months",
            "user_id": "@katiekickscancer",
            "video_content_url": "",
            "video_page_url": "https://www.youtube.com/watch?v=xu6uv0aGTCY",
            "video_path": "sample_data/katiekickscancer/video_content/xu6uv0aGTCY.mp4"
        },
        {
            "_id": "jT2PFFmeeBk",
            "datestring": "2022-03-26 07:24:22",
            "summary": " couldn't believe it. I just kept thinking this isn't real. This isn't real.\n\nThis story follows a 29-year-old woman who was diagnosed with a rare form of kidney cancer. After struggling to find the right treatment, she was connected with Dribb and Decure, a charity organization, who helped her reach out to the National Cancer Institute. After sending her scans and slides, she was approved for surgery with the NCI and had to go through a few more steps before the surgery was officially a go. After being told by multiple oncologists that surgery was impossible, she was finally able to get the surgery she needed and is now on the road to recovery.",
            "text": " And that kind of kicked off a week of what would be just complete and total generosity for strangers and people that we didn't even know. So in my last video, I talked about how Dribb and Decure helped get me to surgery. So probably left off on a cliffhanger, probably didn't make sense why I was going to MD Anderson. And then all of a sudden, everybody knows that I got my surgery at the NCI in Bethesda, Maryland or the NIH. So how I got there was through Dribb and Decure. So my last video got us up until April of 2021. And that was about four months into my diagnosis. And so the rest of this video is going to be about what it took to get me to surgery at the National Cancer Institute or the National Institutes of Health. And Dribb and Decure had a very big hand in getting me there. So as I mentioned in my last video, I had seen this bright orange GTR on another patient's page. And because I worked in the motor sports industry, I wanted to reach out and see if we could connect our networks for fundraising. But when I spoke with Bruce who runs Dribb and Decure now and he found out how where the type of kidney cancer I had was, he instantly knew that the NIH was a place that I needed to be. And when we got off the phone, he sent an email to the top of the top of the NCI for kidney cancer. Once Bruce sent that email, I wasn't sure I was going to get a response, but I woke up the next morning and instantly had an email in my inbox from Dr. Lennie Han the next morning saying that they wanted to take on my case. This was still in that time where I was struggling with my current oncologist and I was trying to switch. This all seemed to happen right at the same time. That wasn't on purpose. It's just kind of how it happened. And so I was still switching oncologists at MD Anderson and I kept that bowl rolling as I was continuing to talk to the NCI. Because I honestly was more reserved about talking to the NCI than I was about MD Anderson. DNH, the NCI, which is National Cancer Institute, in case I haven't said that yet, they aren't like MD Anderson. They don't have a bunch of advertising, they don't have a huge reputation. They're a research hospital, so they specialize in clinical trials, rare cancers, and research. And so I didn't know a whole lot about them. And I was already in the process of switching oncologists at MD Anderson, so I thought I still want to pursue this route at NCI. But as I said, going through so much changes this process really, really stressed me out. And I thought, okay, am I just never going to be happy where I'm at and was second guessing myself every time that I went through these changes? I remember one day after telling me a husband that I wanted to go to the NCI, but I could tell it was really stressful for him that I kept looking for other answers and I couldn't kind of just settle in. And so I promised myself that this was going to be the last stop. So the next morning, I had heard back from Dr. Linahann and at the same time, because I was going through the process where Casey Kure was helping me get to this new oncologist at MD Anderson. I also let them know, Dr. Linahann had the NIH. And then they replied back, offering to put me in touch with the surgeon. So Dr. Linahann had reached out to Dr. Linahann and at the same time, Casey Kure reached out to Dr. Ball who was the surgeon on my case. But the contact kind of came from two different places, but I couldn't be more grateful for both of them. So by the time that Telehealth appointment finally rolled around, I knew that this was my last chance at surgery. Dr. Linahann emailed me, it said that they wanted to take a look at my case, and so I needed to send my records over. So I then uploaded my scans so that the NCI could take a look at them. And then we had a Telehealth visit within a few days. I remember getting that first phone call when I heard that they were taking a look at my scans and wanted to look at my case. And it's almost comical at any time. I ended up on the phone with anybody who has looked at my scans, because this thing was massive and nobody expects to find something this big inside of a 29-year-old woman. So it was very obvious that they were shocked by the scans, but that they wanted to take a further look at it. They did all mention that it kind of looked like an oncositoma, but they definitely needed to get a copy of my slides so that they could know for sure. And they needed to check my histology in-house before they would know if they could operate or not. So then I needed to transfer my slides from my biopsy from the University of Utah over to the National Cancer Institute. And that was very, very stressful. Because I have such a rare case, they tested it over and over and over again, because they thought there's no way that this thing can be a metastatic oncositoma. Those just don't exist. And so they tested it often. So when you take a biopsy, there's so much tissue that you have that you can work with and test. We had used a lot of it. And so we didn't even know if I had enough to get to the NCI. There's a bunch of calls back and forth to figure out if we had enough tissue to do it. We found out that we did have enough tissue barely for the request to make it to the NCI. They sent my slides and I would follow up with them every few days and they weren't getting them. And so I finally decided to track down the tracking number that was used to send the slides and try to figure out where they went and why they weren't there yet. And because of an admin error, they ended up sending my slides to some random tiny hospital in Montana. When I heard that, I was beyond stressed. These were the very last bits of my biopsy and we didn't know if it would be safe for me to go for a biopsy again because I had an internal bleed during the first one. So this was the last chance and I felt like it was slipping through my fingers because we had lost my slides. A whole bunch of calls later, I tracked down the hospital in Montana, had a route around a bunch of people there until we eventually got to the right place where the slides were likely going to show up. And the woman I spoke with there was so kind and so nice. And she assured me that she was going to keep it I out for them. And instantly as soon as they came in, she was going to send them back so we could get them routed to the NCI. So it was a long process to get them there. But my slides did eventually make it to the NCI. They had their pathologist look at it as well who was an expert at looking at Onkosaitomas and has looked at so many of them before. And they also determined it looked like an Onkosaitoma which qualified me for surgery. And I will never forget that next appointment. So it took them a couple weeks to run my slides and do all the testing that they wanted to do. And then I finally had the appointment to talk about if surgery was going to be possible or not. As this happened, I had just barely gotten my new oncologist at MD Anderson like two or three days prior to this next appointment. And so it felt weird kind of talking to institutions at once. But I already had this line out to the NCI. And I knew this was the last stop for me to check. And even though MD Anderson had opened up the discussion for surgery, I wanted to see the NCI out and hear what they had to say. And so I will never forget waiting for that appointment. It was a telehealth appointment and I sat here like clicking my pen for I swear and felt like an eternity. As I was waiting for them to join the call, I was just so nervous and felt like so much was on the line for this call. And I will never ever forget that call. Dr. Linahan got on the call and he let me know that after they ran my slides, it did look like it was likely in Onkosaitoma and that they were hopeful that they could do surgery. But they still needed to get with the surgeon that would be doing the liver surgery to see if it would be possible to remove all the tumors in my liver. Because if we couldn't remove them all, that it might not be worth the surgery. And then I met with Dr. Ball who would do this surgery on my kidney. And I remember that moment was so surreal talking to both of them. I knew I was going to tear up. But I honestly at this point had been told no so many times and told that treatment was simply to prolong my life. And now there was words being tossed around of going for a curative surgery. Believe me, there was no promises. There's never any promises in my case. Because we can't promise anything in my case is so rare and it one knows what to expect. But it finally was in the realm of possibilities. And it was in the discussions. And I honestly didn't believe it at first. And I just remember I was so excited but so in shock on that call that I just I didn't want to believe it just to be let down. So there was still a lot of caveats that we had to get through. We still need to get approval. And they told me that surgery was possible. But I had had so many people at this point. I had literally had four other oncologists tell me that surgery was impossible because of my liver lesions that when they told me that they still need to get with the surgeon to look at my liver lesions to see if it was a possibility. I felt like okay here we know again don't get excited because this likely isn't going to be possible. But I remember as we were on that call Dr. Ball hopped off and he went to go talk to Dr. Hernandez who would end up being my surgeon who would operate on my liver. And I will never forget he popped back in on the call. And he had the slightest smile on his face as he gave me the news that Dr. Hernandez thought he could get them all in the surgery. And that we still needed a check of few things but surgery could be a go. I had a few things that they need to verify first especially because I had a bleeding disorder. I still needed to meet with Dr. Hernandez. And there's a few final boxes to check. And so I was so excited but I just I still didn't believe it. And I remember for several days being in this place where I just I didn't know what to think like I was so excited because I finally going to be able to get the stupid thing out of me which is the one thing that I wanted more than anything else. But I didn't know if it was too good to be true. This call happened at the very beginning of June. Like maybe June 2nd or something like that. And when they told me that surgery could be possible initially they were thinking that surgery was likely going to be in like July or August that it wouldn't be done immediately. And so as I was messaging with the fellow the next couple days told me that I needed to stop Cabo the treatment I was on because my surgery was likely going to be at the end of June. And my mind was blown. This was a little over three weeks away. Such a you turn from where I had been. I didn't know what to do with myself. I of course instantly stopped Cabo and we started preparing for surgery. This was also along the same time that I was having these discussions with MD Anderson. Though I was talking to my oncologist there. Like I said I had just switched to him as an oncologist and I worked so hard to get him that I really didn't want to lose him as part of my team. And I remember having that discussion with him. And it was really hard for me but I was just completely frank and honest and upfront about it. I just said hey I really don't want to lose you as my oncologist if I go get the surgery done at the NCI. And I am so grateful for how you responded. He let me know that of course that he had a lot of confidence in the surgeons at MD Anderson. And he thought it'd be great for me to be able to get the surgery there. But if I had the opportunity at NCI that I could take that opportunity and I wasn't going to lose him as an oncologist. Which is something that I was worried about because I had heard some horror stories about other patients and losing their oncologists. So it was something I was fearful of after everything that I worked so hard to get him on my team. My husband and I then spent the next few weeks preparing. We decided that we were going to stay in Maryland for a month because the surgery was huge. It was going to be several wedge liver sections of my liver. And then it was also going to be removing my right kidney and the tumor. I also have a bleeding disorder that complicated the surgery quite a bit as well. And so we just thought I'd be best if I was nearby. And I'm glad I was. I don't know if I would have been able to fly home any sooner than I did because I wasn't super mobile. We actually ended up taking our cat with us. So that was interesting trying to find housing that we would be able to take our cat up with. And that is where Dr. Vanacure came in to help even more. As part of getting ready for the surgery, I had to go in for tons and tons and tons of blood work because we didn't know for sure what my bleeding disorder was yet. But we knew that I had some of these bleeding issues and we had to get that solved before I could go to surgery. And so I went a little over a week before my surgery so that we could do some more testing. We did some more research scans, tons of blood work. When I landed in DC, I had to go to all my appointments and do everything alone. My husband still had to stay bags. We didn't have anybody to take care of our pets and he was still working. And so I was there for all those first appointments alone, which was really hard. And Bruce made sure I got to him from the airport okay. He helped make sure that I could get in and out of the NIH. He took me around sightseeing DC in that bright orange GTR and he was just so helpful. Talking about the NCI and talking about Dr. Mendecare, Bruce or Andrew are sure ways to get me to cry every single time. And I couldn't be more grateful for his support through that. So Bruce was there supporting and helping us coordinate everything leading up to my surgery. And eventually after I was done with all my testing, I flew back home to Austin. And then because we decided to take our cat up with us, we drove from Texas to Bethesda, Maryland. And that is about a 25 hour drive. And with a cat, that is not fun. It's quite the memory to look back on now, but it definitely wasn't a stress-free experience all my way up to surgery. So we drove and got to Maryland. And then once we got to the NIH, Bruce also introduced us to an incredible nurse named Ali who had really formed a bond with Andrew when he was going through his cancer treatment. And Ali on top of being an incredible human being also happens to love cats. And we didn't know what we were going to do with our cat while I was in surgery. His brain was likely going to be staying at the hospital with me and because of COVID, he wouldn't be allowed to leave the facility. And so we needed somebody to check on our cat because I was likely going to be in the hospital for about 10 days. And Ali offered up to come visit Dorah for us and make sure she was fed and taken care of. And I was so incredibly grateful for that. And that kind of kicked off a week of what would be just complete and total generosity from strangers and people that we didn't even know. Now that I was back in Maryland, we still had more blood work and more testing that we needed to do. We thought we were on the right path for my bleeding disorder, but we weren't 100% sure. Still had more testing than we needed to do. Also because we were doing a surgery on my liver, we needed a lot of blood in case anything went wrong because the liver is very vascular and can have a high tendency to bleed. And with my bleeding disorder on top of that, they wanted to make sure that they had everything in place just in case things went catastrophically wrong. That is one thing that I do love about the NCI. They are very, very prepared. They are the best of the best, but they prepare for the worst just in case. And so I really appreciated that they were thorough on that. And so for my surgery, I think that we had requested 50 units of blood. There was a blood shortage last summer. So they weren't sure that they were going to have enough blood for my surgery. And if that was the case, they were going to have to delay my surgery. But I knew that this was really my only shot at surgery. Everybody I met with drove home the fact that I needed this surgery now and that I couldn't wait any longer. Otherwise, it might disqualify me for surgery. And I knew that because nobody else was even willing to do surgery. Where when I got the call and I found out that it might be delayed if the blood bank didn't have enough blood, I felt completely crushed. I just set up so much and moved everything so that I could have this surgery. And to hear that it might not happen, I was crushed. So my husband and I were walking around DC and the national monument at the time that we got this call. And I made a last-ditch effort to decide to make a post on social media and ask for blood donations. I really didn't think that we would be able to drive very many in. My step-other, I'd lived in the area, but I really didn't know anybody else. And so I didn't think that very many people would see this post, but it was kind of a last-ditch effort. And so I made a post and I requested blood in the DC area for my surgery to be donated at the NCI. And it was met with an overwhelming response. I think it was shared well over 300 times. And complete strangers started messaging me and commenting, letting me know that they had signed up to donate so that they would be enough blood for my surgery. One of my co-workers saw the post and my work ended up sharing with some of the people in the area. One of my co-workers who lived hours away and showed up to donate as well. And I called the blood bank. They let me know they hadn't received a response like this in the like 15 years or so that they had been working there. They said that they opened up slots on the weekend where they normally weren't going to be open and we're staying open later so that they could fill all of these appointments that people were calling into book. And by the time my surgery rolled around, we had driven in 70 units of blood, which gave us the all clear to go through a surgery. And I will never forget the generosity of everybody who stepped in for that. These were people who didn't have a clue who I was, who just saw a post on social media who stepped in to help me get to a surgery that completely changed my life. Every single one of those people that shared, commented, donated, will always hold a very special place in my heart. It was such a surreal experience. I went for appointments for several days at the NCI during this process and this was before I had posted and at various places around the hospital. They had signed up and we're giving announcements over the loudspeaker to draw in donations for a patient surgery. I'm somebody who spent most of my life convinced that everybody hates me. And I will never forget the love that those people made me feel. And it didn't just end with those total strangers. Even one of my surgeons donated and at least one of the fellows, which in itself just shows how different the NCI is from anywhere else. I will make a separate video on the NCI at some point because there are tons of resources about MD Anderson and all of these other different cancer centers. But the one that you do not find much information on is the National Cancer Institute and the National Institutes of Health. And that's because they're a research hospital and a government entity. And I know that really scared me before I went to the NCI. I wasn't really sure what to think about them. I couldn't read reports of patients' experiences and honestly the whole thing terrified me. I'll make a separate video where I'll talk about what my experience at the NCI in general was like. I want to make a dedicated video to that because there are tons of stories that happened through there. But I will just say that I have never met so many doctors, surgeons, physicians and nurses that just care. I cannot rave enough about my surgeons and it's not just because they're the only ones who are willing to do surgery on me. They are both incredible people. Along with all the fellows who work beside them on my case, it is just such a different experience. Such a different dynamic because of the way that it's structured as a research hospital. There's a lot of flexibility and you'll see patients and physicians interacting all the time and it feels a lot more personal. Anyways, so it finally acquired enough blood for the surgery. That meant it was a go for surgery. I knew I had to get the surgery done but I honestly was so petrified. I almost backed out of surgery the day before. It came up to the Monday that I was being admitted for my surgery to happen on Tuesday. I got admitted and then I was having all of these doubts in the back of my head and I was so petrified. As I mentioned, I had so many appointments in lab work and so many people that I was talking to leading up to surgery and every doctor I had talked to it became clear just how many times they were meeting over my surgery and how this wasn't quite common practice and they normally didn't meet this often. It was very reassuring on one hand but also terrifying on another hand. I thought that my surgery was actually going to be a little bit less invasive than like a major liver resection and so I didn't think that this surgery was crazy big and every person that I kept talking to just felt like it was getting bigger and bigger and bigger and so I started to get so terrified and thought that this was going to be a lot bigger than I was expecting it to be. And I remember how scared I was. I had so many wonderful doctors in my team and the night before surgery they all came to my room together to make sure that I was ready to go through with the surgery and I had been on edge all day and been back and forth on if I was going to go through with the surgery and having all them there really meant a lot and gave me the confidence that I needed to go through with the surgery. So I had the confidence to go through with surgery. I was still terrified every step of the way but we went through with the surgery on Tuesday June 29th and everything went well. Thankfully we didn't have to tap into those 70 units of blood we drove in. I did end up needing two units but the rest went to other people who very much needed the blood book the blood shortage. So that's the story of how I got my surgery and how it took me six months to get there. I will make a separate video talking about the NCI like I said I'll share probably some of my stories from the NCI and because I like there's just more information that needs to exist out there for surgery I was very anxious and didn't know what to expect because I didn't have a whole lot of information to go off of. You can find a ton of information on MD Anderson you can not find that much patient information on the NCI and they don't have the resources that MD Anderson does for all of that stuff. I want to make a video in case another patient ever has the same uneasiness that I did to know that they're in good hands at the NCI and some of the wonderful things that happen there. So thanks for catching this video I always appreciate your love and support. See you!",
            "timestamp": 1648297462,
            "title": " couldn't believe it",
            "user_id": "@katiekickscancer",
            "video_content_url": "",
            "video_page_url": "https://www.youtube.com/watch?v=jT2PFFmeeBk",
            "video_path": "sample_data/katiekickscancer/video_content/jT2PFFmeeBk.mp4"
        },
        {
            "_id": "HOpILlb9FyM",
            "datestring": "2022-03-16 07:24:22",
            "summary": " find a place to live and he was like, oh my gosh, I think I found a place. We can get a second opinion at MD Anderson and then he found this place that was like a short term rental and it was like a full house and it was like a dream. It was like a dream come true and it was like a sign that I was like, okay, we're going to go. So we booked the flights, we booked the place and we basically just went for it. We flew out on February 17th and that was the day that Texas had the big freeze. I remember the night before we were supposed to leave and we were like, oh my gosh, is this really happening? We were like, we're literally going to freeze in Texas. We were like, this is insane. I remember being so scared and so excited all at the same time. We flew out and it was freezing. We got to the airport and it was like a ghost town. I remember walking in and it was like, oh my gosh, what have we done? So we got to the place and it was like a dream. We got to MD Anderson on February 18th and we met with the doctor and he was amazing. We had a really good connection with him and he was so thorough. He had read my entire medical file before we even got there. He was like, I've read your entire medical file. We don't need to do any more tests. We just need to talk about what your treatment plan is. So he was so thorough. He was like, we're going to switch your treatment plan. We're going to switch your oncologist and we're going to get you on the right path. So he switched my oncologist. I switched my oncologist to Dr. J. who was amazing. I just felt like he was so thorough and he was so knowledgeable. He really really really knew what he was talking about. He was like, okay, we're going to switch your treatment plan. We're going to get you started on this and we're going to get you started on this. We're going to get you started on this. And then we were going to have to wait to see how you respond to the treatment. So I started my treatment at the end of February. I had my first appointment with my new oncologist and then I started my treatment. And then I was like, okay, now what? I was like, okay, now what do I do? I was like, I just want to be proactive and I want to do something. So I started researching and I found this organization called Driven to Cure. Driven to Cure is an amazing organization. It's a nonprofit. They are focused on early detection and prevention of kidney cancer. They do a lot of different things. They do advocacy. They do research. They do education. And they do a lot of different things. I was like, oh my gosh, this is so amazing. I was like, I have to get involved. I have to do something. So I emailed them and I was like, I want to get involved. I was like, I want to help. I was like, I want to do something. I want to help. So I started getting involved with them. I started helping them with their social media. I started helping them with their education. I started helping them with their research. I started helping them with their advocacy. I started helping them with their fundraising. And it was amazing. It was like a dream come true. I was like, this is what I want to do. I was like, this is my purpose. This is what I want to do. I want to help people. I want to help people like me who have been diagnosed with kidney cancer. I want to help people who are in the same situation that I was in. I want to help people who are confused and scared and don't know what to do and don't know where to turn. I want to help them. So I started helping with Driven to Cure and it was amazing.\n\nAfter being diagnosed with stage four kidney cancer in the ER, this individual went through a long process of tests, appointments, and treatments. They initially thought they had an oncocytoma, a relatively rare tumor, and were hopeful that surgery would be an option. However, after an MRI and biopsy, it was determined that the cancer had spread to the liver and surgery was no longer an option. After meeting with their oncologist and getting a second opinion at MD Anderson, they started a treatment plan. During their research, they discovered Driven to Cure, a nonprofit organization focused on early detection and prevention of kidney cancer. They started helping the organization with their social media, education, research, advocacy, and fundraising, which they found to be a dream come true and their purpose.",
            "text": " Long story short, I got diagnosed in year Z of 2020. I don't ask me a brain MRI, a abdominal MRI, a biopsy, flew to Texas for a second opinion at MD Anderson. Ultimately ended up moving there a week later, went through the crazy Texas freeze, started a treatment, switched oncologist, had the treatment plan change, and then met driven to cure, which completely changed everything. So one of the next videos I'm going to record is going to talk about the best questions to ask when you go for your first appointments after you've been diagnosed with cancer. But before I got to those videos, I thought I would finish up the story about how I got diagnosed and my road to surgery because it was a long one. So oftentimes when people are diagnosed with kidney cancer, they'll just go straight into surgery. If you're diagnosed at stage four, oftentimes that depends on kind of where you're at and where it has spread. If you will go to surgery or if you will go straight onto systemic treatment. So I talk about what led up to me being diagnosed in my previous video. Can check it out here. And so I talk about the process. I was feeling kind of off for about a year and a half and they kind of just thought I had anxiety, which was causing my high blood pressure and my tachycardia. Eventually I ended up being diagnosed with stage four kidney cancer in the ER. So I'll start kind of from there and I will talk about how I got to surgery and everything that happened up until I had surgery. I had surgery on June 29th. So it was about six months later. So I'll talk about kind of what happened during that period until I made it to surgery. It was a long road. All right. So in the ER that day, they found my tumor. So I had a 12 centimeter tumor on my right kidney and at the time we thought there was about six liver lesions because they were seeing the larger lesions that were in my liver. Some of the biggest ones were about the size and then some of the small ones went all the way down to one centimeter, which is like about the size of a pea. Eventually when my tumor came out, this is what it looks like. So it just kind of gives you a general idea of how big it was. What I have is called a oncocytoma and I have a metastatic oncocytoma, which meant it spread from my kidney to my liver in my case, which is extremely, extremely rare. I then went to meet with my oncologist and I met with my oncologist on January 6th. But I did not know our capital was under attack when I went for my appointment. This was the first appointment. I knew that I was likely stage 4, but I didn't know anything else other than what I had found on Google. You don't want to Google your diagnosis. I thought I'd go into that appointment to get my questions answered and I would search treatment immediately. First appointment, especially if you're diagnosed in the ER, is really just about establishing care. And so that's what we did. The oncologist also got started on ordering a whole bunch of tests. He was amazing. He ordered absolutely everything up front that he should have. We had done genetic genomic and somatic testing. We basically were testing everything we could to try to figure out why this happened because I was so young. We thought I likely must have had a genetic mutation or something like that that was causing the cancer. So he ordered all that. He also ordered an MRI of my brain and an MRI of my abdomen. Met with him, got everything scheduled. It took weeks to get an MRI. One, it was the beginning of the year. And then I remember how distracted everybody was and I did not understand why. I felt like I couldn't really get anybody to pay attention or care to the fact that my scans were being pushed out by three weeks. My oncologist sounded like he wanted me to get in for those ASAP and everybody just seemed very distracted. I remember once I got home and realized everything that was going on at the Capitol. I felt so selfish. Like I was all caught up in my world over here trying to get my scan scheduled and all caught up and just like thinking like, oh I'm gonna die. And there was much bigger problems going on in the world. What an interesting day to have your very first appointment. From there I went in, had the colonoscopy, everything looked normal from the colonoscopy. Outside of appointment with the surgeon was going to remove the tumor. If the spots in my liver came back benign. But he did clarify for me that that was only possible if the MRI told us that the tumors in my liver were did not look like metastatic disease. My tumor looked like an oncocyteoma. And oncocyteomas on a scan often have what's called a central scar. Pretty unique to oncocyteomas although some other types do occasionally have it. And oncocyteomas only have it about 30% of the time. It looks like a giant asteroid hit it. I know that's like not a medical way to describe anything. But that's what it looks like to me. It looks like a giant asteroid hit it. It's what they saw in my scans and why they thought it was an oncocyteoma. So I remember after I left my first appointment and I found out, okay this could be an oncocyteoma. I met with the surgical team to see if it was possible. If it was an oncocyteoma we were just going to remove the tumor. And then I wouldn't need any follow ups because oncocyteomas are benign. But I was told if it had spread to my liver. It's already stage four in that surgery wouldn't be possible at that point. There'd be no reason to do surgery because we couldn't do surgery in my liver because the tumors were too large and there was too many of them. I would just start on systemic treatment. But we had to wait to find out if surgery was going to happen based on the MRI and my biopsy results. Then I went for my MRI. We got the MRI results and I remember waiting for that MRI pays back and forth and just think, okay please be an oncocyteoma, please be an oncocyteoma, please be an oncocyteoma. I was so ridiculously stressed. I just wanted this thing to be an oncocyteoma so I could just have surgery and be done with it. Anyways, so we got the MRI results back and they thought that the lesions did look suspicious in my liver and so I was going to go for a biopsy. I already had the biopsy scheduled but now we are going to do a biopsy of my liver at the same time. You can check out my biopsy video where I talk about what that process was like. I did have a small internal bleed that earned me an overnight stay. So when I got the results back, oncologists called me in the evening to let me know the results that it did turn out to look like it was stage 4 kidney cancer that had gone to my liver and that those liver lesions were metastatic disease. So in that time, I read my pathology report which called my tumor in unclassified oncocytic neoplasm. The pathologist was a very thorough in the comments which I am extremely thankful for. I looked up everything in the comments and I was trying to learn as much as I could about kidney cancer and histologies, different subtypes at the same time so I could understand what my diagnosis was and at the time I was looking up all the different types of kidney cancer and trying to find out kind of the different ways that they describe them in pathology reports and what they look like. So as I was reading the comments, I noticed how closely this resembled an oncosytoma and the way that an oncosytoma's histology was described. And an oncosytoma was also listed in my differential. It mentioned and overlooked a lot like an oncosytoma but metastatic oncosytomas were exceedingly rare so we needed to get back additional testing on it. So when I met with my oncologist, we talked about next treatment options. So he wanted to get me started as soon as possible on treatment. We were going to start. Me and it was Axi Pembro. Don't quote me on that but I feel like that was the one we were going to start. We were going to do a TKI immunotherapy combo which is like a chemo pill they sometimes call it. It's targeted therapy and then immunotherapy. So I talked to him and he told me that what I had was pretty rare. It looked like it had probably been there a long time. I'm guessing part of that came from the fact that it looked like an oncosytoma. My case had been to tumor board which is basically where everybody gets around and talks about the case and treatment as a group to try to figure out what the best plan is and they decided that they thought it was best that I started on the treatment. This all happened at the end of January and so I was almost a month out and in the meantime my husband and I had been looking into different institutions because we already from my radiology report knew that this could have been an oncosytoma or a chromophobe possibly which were two relatively rare tumors on the kidney. We started looking into second opinions anyways. When we looked at different places that we might be able to get a second opinion on I could feel this thing in my stomach and it was still my ultimate goal to get this thing out. I asked every doctor that I met from that point forward if we could get surgery done. They all gave me that exact same answer that I had too many in my liver that they were too big. We couldn't operate but that was always my ultimate goal because I could feel it just mentally I wanted it out of my body and I was not going to give up till I got there. So once we knew it was cancer we started to look at where we'd go for second opinions. At the same time we were also trying to look for an o-place cliff. Our lease was up on our townhome and then we were building a house for our future family when I was diagnosed and that house was quite large and it was going to be way too big for us both. We were looking for housing at the same time as we were looking for places to get a second opinion and my husband was looking at MD Anderson and that's in Houston, Texas. I had actually lived in Texas and moved back to Utah after my grandmother passed to be around family. I met my husband there and then we had to stay there for his job at the time and so I had given up on the idea that I'd ever be able to move back to Texas even though that's why I wanted to live. My husband and I joke all the time that I could have found a less dramatic way back to Texas but I remember him sitting at the computer as I was like frustrated that we couldn't find any decent housing and I remember I'm asking if I want to go to MD Anderson as he wanted me to see the best of the best. So some of the best cancer centers for kidney cancer are Sloan Kettering in New York and MD Anderson in Houston and he knew that I love Texas in Houston and so he asked me if I wanted to start looking into MD Anderson. So we went through that process, I sold up MD Anderson and got set up with an oncologist there, started transferring my records and started looking at housing in Texas. First that meant we were going to fly out to MD Anderson to get a second opinion and during this whole time I constantly questioned if this was the right decision to make because because it was stressful and I felt like are they going to tell me the exact same thing and then I've just delayed treatment trying to get these second opinions and as it even going to be worth it and I was very stressed out at that moment. I wasn't sure if I was making the right decisions. My husband and I are very similar on a lot of things but this is one thing we talked about, we are quite different on. He's mentioned that if he had gotten the same diagnosis that I had, he likely wouldn't have gone for any second opinions. He probably just would have gone with the first oncologist and then started treatment immediately, whereas I was kind of always trying to look for second opinions because it just didn't seem right. My diagnosis wasn't sitting with me right and I just felt like I wanted to see a specialist but this was so stressful not just on me but on him as well and so I constantly thinking about everything and wondering if I had made the wrong decision in deciding to get a second opinion because of how stressful that process was and was I just delaying care. So we flew down to MD Anderson knowing that by the end of the week, if the appointment at MD Anderson went well, we were going to be moving to Texas and so we had an Airbnb setup that we were going to move to if the appointment went well. Before we flew down to MD Anderson, I was part of some of these Kidding Cancer Support groups and I had somebody in the Stage 4 group, Marvin and Debbie, I love them. Marvin reached out to me and mentioned something about if I ever wanted any information about MD Anderson, he'd be happy to chat. My husband and I had a call, we had Marvin and Debbie on speakerphone before I went down for MD Anderson when I was still second guessing on if I was making the right decision and they were absolutely incredible. I remember talking to them and Marvin giving us the rundown on what MD Anderson is like and just a glowing review of MD Anderson and it just felt like that was the right move and I was going to be in the right place. So we decided that we were going to move to Houston. We got home and immediately packed everything that we had already packed some stuff before we left because we thought that this was the route we probably were going to take but we packed up everything, here's some pictures and photos of that time period of us packing everything up and it was a quick move but we packed up everything and then we put it in a shipping container. My husband and I had a few belongings with us and a suitcase each. We couldn't fit much in the car because we also took our dog and our cat down with us and that is an experience but we drove down to Texas and then we got to our first Airbnb there where we were going to be staying. Also was an experience Airbnb wasn't in the best area. We didn't know a whole lot about Houston at the time and so we didn't know which areas were nice and which ones weren't but we got an apartment at an Airbnb there that wasn't too far from the medical center and I took back some out for a walk one day. I was bringing him back in. There was somebody on the corner. There was like shops on the bottom of this apartment complex and I was like walking and I saw somebody on the corner there and they're in the middle of sidewalk. This is COVID so I'm like actively avoiding people and so I looked down there and noticed that there was somebody on the sidewalk so like I went the long way, tried to go out into the parking lot and as I was walking by this person they screamed after me and they started cursing at me and then they started to come out me and then I got scared and I like swooped back stir up as quickly as I could and like I ran and I looked behind me and this guy was literally chasing me and I was petrified. This was in the middle of a parking lot and so like I was zigzagging in between cars and I was terrified and then I looked back at one point and he wasn't there anymore but I got so scared. I like went the long way around, went around some bushes and then I couldn't tell where he was anymore so I was really scared and went back up. Anyways we decided that probably wasn't going to be the safest place for me to take back stir out and so we actually ended up getting a whole nother Airbnb after that. This is my first week in Texas still going through the diagnostic process so dang stressful. We got into the new Airbnb and we were there I think for a day or two and then the Texas freeze happened. So the big historical freeze that shut everything down my husband because we came from Utah he didn't want to bring a coat because it doesn't get cold in Texas when you're from Utah. I tried to warn him that it does actually get cold in Texas he wasn't buying it so he didn't have a coat which was great as during the freeze we were without water for I believe six days and we were without power for three or four. I had to go to HB every day and he had to wait two hours outside in the freezing cold so that we could get two gallons of water every single day. It was a nightmare. I remember being so cold we piled up on the beds and it got to I believe 40 degrees in the house. We piled on the beds had all the animals with us where it's bundled up as we could and I remember laying in bed there and just thinking like I have made the biggest mistake of my life like I shouldn't have moved out of Utah. What are we doing here? I just want to go home and I was so stressed miserable. First week of trying to go through the diagnostic process, get new scans and start treatment. First week of Texas things were not going well but that did end up getting rescheduled. I did end up having my scans again when I resched everything looked stable it didn't look like anything had grown at all. After the freeze we got my scan results and then we decided I was going to start on Cabo. So Cabo when you start treatment they send you a trial I think it was like a two or three week trial of the pills while they work to try to get approval through your insurance. So I started on that while they worked on getting approval through my insurance that was super stressful. My insurance denied it at first and they had to repeal it. But my oncologist put me on Cabo I think that was an excellent move on her part which is a targeted treatment sometimes they call it a chemo pill. It's a oral pill that I took daily. I had asked her the same questions every appointment that I went to because of how bad I wanted to sing out of my body. And I asked her if I would ever qualify for surgery and after they had taken my case to the tumor board they talked about the fact that I might be able to qualify for surgery but we would have to shrink all the tumors first and I thought that that was still in the realm of possibilities but knowing how big my tumors were now I understand why she said what she said to me because she ended up telling me that have surgery if we got rid of all the tumors in my liver but she told me she did not want me to get caught up in that idea that the main purpose of treatment was just to prolong my life as long as possible but that there wasn't a cure and that Cabo isn't a cure. I had the time admittedly was a little bit or about being told not to get caught up in the idea that the tumors in my liver could ever be gone thought it was possible. I now know why she said that due to the size of my tumors and how many I had it was very very unlikely that Cabo would have ever been able to get rid of those on its own so I totally understand why she said that at the time it wasn't necessarily what I wanted to hear of course. It's not their job to tell me what I want to hear it's their job to tell me what I need to hear but she did make a really good call I think to start me on Cabo right as we started that we had decided to move to Austin and then I was on Cabo for two and a half months so about three weeks into my treatment on Cabo I ended up switching oncologists. There have been a couple times that I just I didn't feel like I was in the best spot with my current oncologist. Like I said I think very highly of her and I think she's very brilliant I just don't think that it was the right fit for my case. I didn't want to switch oncologists because I'm somebody that avoids conflict I really respected her and again I felt like I was just causing a stir for nothing. I had all of those same feelings that I had when and I wanted to get a second opinion at MD Anderson I felt like okay am I gonna hurt my case? Me even thinking about getting another oncologist is she gonna be upset with me? I didn't want to make her upset just very very stressful. I really didn't want to switch oncologists but I just knew that that was going to be the right decision for me and so I had been speaking with another patient who had been going to MD Anderson she had a rare type of kidney cancer and she spoke very very highly of a specific oncologist. I had also seen him all over a bunch of videos about rare kidney cancers and had seen a lot of information about him kind of being the go-to person for rare kidney cancers at MD Anderson and so I at this point knew I really wanted him as my oncologist. It was a big messy process to try to switch on maybe I'll talk about that process in another video as well. Extremely stressful. I did ultimately end up switching oncologists. This straw that kind of broke the camel's back was dry and started Cabo. I started getting some gum bleeding but it wasn't too bad yet. I went in for my second dose of my COVID vaccine and then when I had gotten a little bit of a red rash and then my gum started bleeding a lot more and so I had called the nurses line and they told me to go to the ER just to get checked out just in case. I just wanted to make sure I wasn't having any bleeding issues especially since I had a bleeding disorder. Again this was from the Cabo not from the vaccine but they wanted me to get checked out just in case. So I went to the ER and then I had message and oncologist at MD Anderson to let her know that I was in the ER. When I was in the ER they had me stop taking Cabo until I could talk again with my oncologist to restart. And so at that time I had already established an oncologist in Austin. Basically the setup that they wanted is they wanted me to have a local oncologist if I was going to be living in Austin because I was far enough from Houston that I needed somebody here to monitor for side effects who knew my case if I ever ended up in the hospital. Brother broke the camel's back was after I had been in the ER I had messaged my oncologist at MD Anderson and I couldn't get a response back. Let her know that I had been in the ER and I was waiting to figure out if I should restart Cabo. And I had also asked my Austin oncologist if I should restart Cabo as well but that decision was supposed to be made by MD Anderson. And I didn't get a response back about a week when I hadn't gotten a response. That was kind of the last straw for me and I decided okay I probably should find another oncologist. And so I worked with KCCure which is a Kidding Cancer organization. I knew the oncologist that I really wanted to switch to. They reached out on my behalf to connect me with that oncologist and he was willing to take on my case which I am extremely grateful for. I had some communication issues with the previous oncologist but all of the oncologists at MD Anderson are amazing and my previous oncologist like I said I think she's brilliant and I respected her a lot. I just don't think she was the best fit for my case. I ended up switching and I absolutely love the oncologist that I have. He is incredible. He's brilliant. He's very smart and he's extremely responsive which I appreciate so much. So during that time I switched oncologist and then my original oncologist wanted to wait three months to scan me after Cabo. I had asked them if I could scan at six and they told me no there's no reason to. I switched oncologist. He wanted me scanned at six weeks, six weeks we scanned me again and we could see that I was responding to Cabo but then with my new oncologist my treatment plan also changed. So his main goal was to then get me to surgery instead of just keeping me on systemic treatment and just prolonging my life. He thought that if we could get these tumors to shrink enough to the point that we could do surgery that cure could be in the realm of possibilities. So our primary goal there switched to getting to surgery but the surgeon at MD Anderson didn't feel comfortable yet with the number of liver lesions that I had and how big they were. He still didn't think I was in a spot that was operable and so we were going to have to continue on Cabo until it shrunk enough and then they wanted me to get the surgery done at MD Anderson. During the same time so as I was switching oncologist for MD Anderson I had also met Dramaticure and I'm going to make a separate video where I'm going to talk about Dramaticure and how I got to surgery from that point going forward because that's a whole story in itself. When I started on Cabo and when I was told that treatment was just to prolong my life as long as possible I still never gave up. I knew how rare my case was and I just wanted this massive tumor out of me. So I constantly was reading as many research papers as I could. I was learning as much about kidney cancer as I possibly could and reaching out to as many places as possible. One day when I was browsing on another patient's page I found a bright orange GTR and an organization that supports rare kidney cancers which felt like a crazy coincidence for me. So I worked in MotorSport about 15 years in my entire career and MotorSports is a pretty niche industry. Rare kidney cancers are super niche. So the fact that these two worlds collided felt like a crazy coincidence and I knew I had to reach out. When I initially was reaching out to them I was reaching out just thinking like maybe we can connect our networks. I'd love to go to one of their events and help fundraise for kidney cancer but originally it reached out to them for that but while I was on the phone with Bruce now runs Dramaticure he had asked me what type of kidney cancer I had and when he found out how rare the type of kidney cancer I had was he instantly put me in contact with the National Cancer Institute or the National Institutes of Health and they are finally who approved my surgery. We'll talk about that process in my next video. I can not be more grateful for Dramaticure and everything that they did for me. Between Dramaticure and KCCure I wouldn't be in the position that I am now with an amazing oncologist who have been able to have such an incredible surgery to remove that tumor. I am so incredibly grateful that I found them and that they were willing to help me. So incredibly grateful for the National Cancer Institute and everything that they did for me and the surgery and that that video in itself is going to be extremely long. Everything that happened just feels insane. Almost didn't go through with surgery for many reasons. We had to do a last minute blood drive to go through with my surgery. It was nuts but I would not be where I am today if it wasn't for Dramaticure and I will share that story in the next video. That's it. Adios. See ya.",
            "timestamp": 1647433462,
            "title": " find a place to live and he was like, oh my gosh, I think I found a place",
            "user_id": "@katiekickscancer",
            "video_content_url": "",
            "video_page_url": "https://www.youtube.com/watch?v=HOpILlb9FyM",
            "video_path": "sample_data/katiekickscancer/video_content/HOpILlb9FyM.mp4"
        },
        {
            "_id": "JcLkww0tEIc",
            "datestring": "2022-02-26 07:24:22",
            "summary": " Epstein bar and that was just going to be something I had to manage. I was still having abdominal pain. I had an ultrasound and they found a mass on my kidney. I had a biopsy and it came back as stage 4 kidney cancer.\n\nA 29-year-old woman was diagnosed with stage 4 kidney cancer after experiencing abdominal pain for about a year and a half, as well as other symptoms such as extreme fatigue, sore throat, nausea, headaches, hair loss, weight loss, and swollen lymph nodes. She experienced a high blood pressure of 165/115 and a rapid heart rate of 165, which sent her to the ER, where they found her platelets were slightly elevated and her white blood cell count was slightly high. She was told to follow up with a primary care doctor and a cardiologist, who found nothing wrong with her and attributed it to anxiety. She eventually found a new primary care doctor and was tested for Epstein bar and POTS, which she ended up having. In May, she was put on a beta blocker, which helped lower her heart rate. An ultrasound found a mass on her kidney, and after a biopsy, she was diagnosed with stage 4 kidney cancer.",
            "text": " It's very vivid in my mind that I said those words. I'm terrified that we caught this too late and it's stage 4 and has already gone to my liver. Alright, I thought I would make a quick video talking about my diagnosis timeline. When people find out I was diagnosed with stage 4 kidney cancer at 29, the very first question they always have is what were your symptoms? And number two is always how were you diagnosed? Kind of trying to track down different symptoms I was feeling for about a year and a half before I was actually diagnosed. And so I thought it'd be helpful to share that timeline and what that looked like. A lot of these symptoms weren't related to the kidney cancer. Some of them were, I think, and others weren't. But I thought I'd share the whole timeline here because it helped paint the picture of why it took so long for me to get diagnosed, which I think is really important because a lot of people typically blame my physicians and I did have several physicians that told me I was too young for cancer and just kept telling me I had anxiety over and over again and that nothing was wrong. But I think if you understand the whole timeline and everything that we were pursuing, some of that makes a little bit more sense. Do I still wish that they didn't say those things to me? Yes, definitely. It's frustrating. But I hold absolutely no animosity towards them. They were just doing their job. But at the end of the day, it doesn't benefit anybody if I'm upset or hold any animosity. I actually no longer live in Utah, but I keep in touch with the primary care provider that I had there when I was diagnosed. Because at the end of the day, I know nobody wants to let the 29-year-old walk out of their office with state 4 cancer. Nobody wants that. And so I realized that I'm the exception and not the rule. And the symptoms I was having overlap with a bunch of different things. At the end of the day, I feel like there's a lot more to gain if I just share my diagnosis and how everything evolves. Maybe there's something that they might be able to identify in me that might be able to help them with another patient one day. So that's kind of my perspective on it all. I'll just zoom out at a really high level of view. I'm not going to talk super in depth about all of these things. But basically, the long overview is I started having abdominal pains, severe, severe abdominal pain, still the worst pains I've ever felt in my life. These pains would double me over and literally take my breath away. But they would only last between five minutes and 30 minutes. And so I never went to the hospital for them. Looking back, I wish I would have. But they were extremely painful. I've passed gallstones and had my gallbladder removed. And I've also had a liver resection and some pretty big surgeries. And the abdominal pain was way worse than any of those other pains. So it was very severe and it was persistent. So the abdominal pain persisted all the way through until we removed my tumor. That eventually did end up going away. This abdominal pain, I would get one week before my cycle each month. And everybody attributed it to just my menstrual cycle or endometriosis. But it would happen for an entire week. I had to modify the foods I was eating. My Von Wolderbrands levels also dropped that week. So I personally wonder if that's related at all if I may have had any bleeding. Because the pains felt very similar to the pains I felt when the blood drained into my pelvis from the bleed that I had during my biopsy. Shout out to my biopsy video again if you want to find out more about that. All right. So like I said, it started with the abdominal pains. But I did not actually seek a whole lot of care. I found out I had a high blood pressure when I was following up on that. I had 165 over 115. It's kind of embarrassing to share this whole timeline because I realized how little I knew about the medical system. I didn't have a primary care doctor. I thought I was young and healthy and in my 20s and didn't need one. Big mistake. Everyone should have a primary care doctor even just to go for annual checkups and to establish baselines in case anything does go wrong. So I was very naive. I had no idea that 165 over 115 was high blood pressure. I just know it shocked the nurse and then they sent me on my way. So if something I should have followed up on, but I didn't. Also, so there's a few symptoms that will go across here. Basically, I had about six month period where I had eight bunch of different symptoms. And I don't really think those were related to the kidney cancer. We eventually, six months down the road, got into some testing and think that I had Epstein bar during that period. We never found an acute infection. And so we just found that I had high antibodies, but my symptoms had kind of lined up with what Epstein bar feels like you catch it into your adulthood. So eventually, six months into the diagnosis, we had pretty much established that we thought I had Epstein bar that might have triggered POTS, which is postural TACCA cardio, which was causing the rapid heart rate or it was just caused by anxiety. So I'll step through this timeline very quickly, but that is kind of the long and short of what a lot of me following the diagnosis was. So in July and August, I had some extremes fatigue, sore throat, nausea. This fatigue was the worst that I've ever felt. I would walk down the stairs of my apartment complex and sometimes feel like I was going to follow my face because I couldn't get my legs to move. They would move. I just felt like they were weak and going to buckle and then like walking into the grocery store, which is so draining. I felt like it was going to take everything I had just to get across that parking lot. I was drinking two red bolts a day, trying to stay awake. I just, I had extreme fatigue. In October, I had had a headache for three days, ended up checking my blood pressure. My blood pressure was high, went to an urgent care. The urgent care sent me to the ER because they found I had a resting heart rate of 165. And that's kind of what kicked everything off. So we found that I had tachycardia and that's what we were most worried about. The ER just basically told me that they just thought I had a panic attack. They found that my platelets were slightly elevated. They were 475, but I had no baselines to know that that wasn't normal for me. My white blood cell count was slightly high at that time as well. I also lost my appetite completely during this time and for the next couple months. And then they told me to follow up with a primary care doctor and a cardiologist. I established care with a primary care doctor and a cardiologist. The cardiologist did a heart rate monitor, echocardiogram, stress test. I ended up telling me nothing was wrong with me. It's probably just anxiety and put me on calcium blockers. The primary care physician kind of thought the same thing that it was just anxiety and wanted me on anxiety medications. December, I ended up finding a new primary care doctor closer to where I lived. I started to have some hair loss. My hair was starting to thin quite a bit. I've got some sweet baby hair leftovers from some of that hair loss that I was having. I also had some weight loss. I was trying to lose weight at this point, so that's what we thought that was attributed to. I had some swollen lymph nodes in my neck. Again, that kind of is what influenced that Epstein barb check. And then establishing care, we did run lab. My EGFR was at 79. So then in January, I still was saying I'm not feeling well. I don't know what's causing this hair loss. So my primary care physician ran some labs to test my thyroid function. It was normal. Again, I just thought I had anxiety. But they were humoring me, which is what I appreciated the fact that they were still running these tests. I also self-referred to a cardiac electrophysicist because I was trying to figure out why is my heart rate so high. So every doctor I went to, I just felt like something was wrong. I've had anxiety before, but this was different. I literally felt like I was running a marathon all the time. And I couldn't get anybody to take me seriously. It also just told me it was just anxiety. And I likely had a high heart rate because I wasn't feeling well that week. My primary care physician, reran, labs in January, and my EGFR was 88. Then I still wasn't feeling well. First, like I said, I had so many weird symptoms. I also had some like floaties in my eyes. I had a bunch of really weird symptoms for like six months all the way up until we had hit March and some of those had started to go away. So the ENT decided to test and found Epstein bar. Like I said, it was not an acute infection. They just found that I had high antibodies, so I had had it sometime in the past. They think that that could have been what was causing all those really weird symptoms. They also think that that could have triggered the pots. So in May, the PA from the cardiac electrophysiologist, he had put me on a new beta blocker. I was on propranonol. He thought that that would help with both the anxiety and help lower my heart rate. And it did help lower my heart rate quite a bit. But the PA is the one that actually ended up diagnosing me with pots. And then she also wanted to rule out any issues with my adrenal gland and make sure I didn't have any adrenal tumors. Again, nobody wanted to scan because of my age, but they ran some blood tests. They weren't up for a nifran, the metaneffran and we did a 24 hour urine test and everything came back normal. So again, my doctor's poor testing. They did keep just reassuring me that I just had anxiety, but testing to try to rule things out. Again, this is kind of embarrassing to share because it makes me feel like a hyperchondriac. Like I was just chasing this high blood pressure and my TACA cardiac. I know I just didn't feel good. It did not feel normal. Always feel like I was having to run a marathon. And so I just kept pursuing that. I felt like a hyperchondriac most of the time and I didn't know how to navigate the medical system, which is kind of embarrassing to look back on. But I think it's important to point out because I did make some mistakes a lot in the way. But I just felt like something was wrong, so I just kept pushing forward. After we had ruled out everything with all those tests and pretty much had just decided I got pots from Epstein Bar, everything kind of simmered down and cooled down. I was still getting those abdominal cramps that were extremely severe every single month. They kept just being chucked up to my menstrual cycle or endometriosis. And so then I had got engaged in July. And so things were kind of slowing down and I was just focusing on my health and I lost 50 pounds at that point. I was walking four to 10 miles a day and eating much better. So again, that's what I attributed the way we lost to. So then I got married in October and planning on having a family. So primary care physician referred me to a gynecologist so that we could follow up on those abdominal cramps again. I wanted to make sure everything was okay for me to get pregnant. And so we did a pelvic ultrasound and everything was normal there. So again, they just thought, okay, that's probably either endometriosis or just your menstrual cycle. So then in December, like I said, my husband and I were planning to start a family. So we were building a new house in a new city. So I got a new gynecologist and a new primary care physician in that city. And that gynecologist kind of followed up on the same thing. She told me that she thought my symptoms did line up with endometriosis. But because endometriosis, you have to typically do a surgery to find it. She wanted to rule out a couple other things first. She wanted to get a colonoscopy to make sure that I didn't have crones or anything else that was going on. And she really wanted to get down to the bottom of why it wasn't feeling well. So I definitely really appreciated her. The new primary care physician ran a bunch of labs. All my labs were still normal. My platelets were still high. But everything else was normal. It was a really long process. So this got us all the way up to the month that I got diagnosed. So like I said, a lot of these symptoms in this timeline weren't chasing symptoms of kidney cancer. The tachycardia and the high blood pressure and the abdominal cramps, those were consistent through the whole time. And those were the ones that I was really trying to push through and try to get a resolution to and trying to understand why do I feel so off. Every doctor I kept seeing kept telling me I was too young to have high blood pressure and my heart rate shouldn't be that high, but they all thought it that it most likely was just anxiety. Those were the ones that we continued to push on. The rest of the stuff in here gets kind of messy, but I thought it was valuable to share because most diagnostic processes aren't straightforward. And a lot of kidney cancer is found in the diagnostic process for other things. So that's why I thought that it was important to share. My process definitely was not straightforward and we did find it in looking for other things. And I think that much of all of these symptoms that I felt during this period of time have completely resolved after surgery and after I have recovered. I do still get tachycardia occasionally, but my heart rate is much better and I am no longer on medications for it. My blood pressure is totally normal now. Sometimes it actually runs a little bit low, but without symptoms, I do think the blood pressure was definitely related to the kidney cancer. The abdominal cramps have completely gone away as well. Those completely went away after surgery too. So we don't know if all those things were related to the kidney cancer or not. Like I said, I do think that the blood pressure most likely was, but I don't know if we'll ever know if all of the other items were tied to the cancer or not. That gets us all the way up until the day before my diagnosis. So like I said, on December 30th, I had gone to a follow up for the new primary care doctor to follow up on the lap results that I had had. And I had told her about the hardness that I was feeling my upper right abdomen, but because the gynecologist was going to be sending me for a colonoscopy. She said that it wasn't anything to worry about. That if there was anything there, that they find it in the colonoscopy. So I just didn't quite feel right about that. I remember I went home and I felt this hardness in my abdomen. I had noticed it for several days and it wasn't a lump or anything. It was a hardness. And because of everything I had been through up until that point where I just felt like I felt like my body, I don't know how to explain it, but I felt like my body was trying to flag me to tell me that something was wrong. I just felt off. And this was another one of those things that I just felt off about. And so I was actually very nervous to go for the colonoscopy. It's never not something I had ever had done. I was really worried about this hardness. And so of course, Dr. Google had convinced me that that hardness might have been on in large liver. And it was something I was really worried about. Like, could I have complications if I went through, if I went under anesthesia with an enlarged liver? I don't know. Dr. Google can take you to some interesting places. And so I was quite worried about that still. And so I just didn't feel right about it. So I remember I got home from that appointment and I called up my mom and I just told her about my new doctors. And I remember telling her I was really worried about the colonoscopy. And this is one of the things that really stands out very, very vividly in my mind the day before my diagnosis. So I had gone to that appointment and I was telling my mom about this hardness that I was feeling in my upper right abdomen. And that I still just didn't feel right about it. And then I was worried about the colonoscopy. And of course in my head I was worried about like, could I have colon cancer or something and I remember being on the phone with my mom. I actually ended up tearing up because I was so scared of what this hard mask could be. And I remember saying to my mom, I'm scared that it's stage four and that it's spread to my liver. And what I was referencing at the time is I thought maybe I could have had colon cancer that spread to my liver and was causing this. But it's very vivid in my mind that I said those words. I'm terrified that we caught this too late and it's stage four and has already gone to my liver. Don't know what in me felt the urge to say that or why I was thinking that I just didn't feel right. And so it's crazy that I said that. But that is one of the conversations that stands out very vividly in my mind. And it was when I hung up from that conversation with my mom that I decided to go to the urgent care. And I really laid at night on December 30th to an urgent care as like one of the last patients in there. And there was a nurse practitioner who came in and originally did the physical exam. And when I laid down, you couldn't feel the hardness. But when I stood up, you could feel it. So I stood up and he was able to feel the hardness in my upper right abdomen. And I told him I was concerned. I said I might feel kind of crazy. Told him that my worry was that it wasn't in large liver. He felt that mass and he said that it could be possible that it could be an enlarge liver. And I'll never forget that moment because I had spent, as you'd seen that timeline going so long just feeling like a hyperchondriac. Everything was just anxiety and that nothing was wrong with me. And this nurse practitioner was the first person to take me seriously. And I remember it very clearly because it was December 30th. So COVID cases were very high at the time and I was very nervous to go to the ER. And this nurse practitioner told me I could follow up with my primary care doctor or I could go to the ER. And I was very, very nervous to go to the ER because after all I felt pretty well. I just had this hardness. So like I didn't physically feel ill other than my heart rate that I had been dealing with. But I was nervous to go to the ER because I felt like I were busy with COVID and I didn't want to be a distraction. So I remember him reassuring me in that moment. And I remember him saying perfectly okay to go to the ER for something like this. He said most things that go wrong go wrong in our head and our abdomen. And this is in an area that I think you could be just fine going to the ER for and it would be totally justified and that there would be somebody there to take care of me. And that moment really meant a lot to me. Like I said, it was one of the first times somebody took me seriously without making me feel like a hyperchondriac. But I was still nervous and I wasn't really sure if I should go to the ER. That nurse practitioner ensured me that it was perfectly reasonable to go to the ER for this. And so I got in the car. I wasn't quite sure what to do. I felt very conflicted in primary care doctor. Didn't really seem to care about it earlier. So I didn't feel like I could just go back to her for it. But I had decided to instead go to the ER. I was petrified like I was so scared and so nervous in this moment. I remember calling my husband and I told him I said I could go back to my primary care doctor or I could go to the ER. But just something tells me something is not right and I need to go to the ER. And I told him I just had this gut feeling that I needed to go in and even though I felt okay. And just for the record, everybody thought I was overreacting here, including myself. But I just felt like something was wrong and so I had to go to the ER. And so I went to the ER. I got checked in. They took me back to a room and I remember the first doctor that came back was kind of asking me what was going on. And I told him I had felt this hardness, my upper right abdomen, and I had come from an urgent care and that they thought that it would have been an enlarged liver. And I remember him kind of dismissing it a bit. I remember him giving me a physical exam and he said, yeah, that's definitely not an enlarged liver. Don't really feel anything. So I could tell I was heading down that path again. I felt like I was just going to get another anxiety diagnosis and so I felt really dumb for being there. But they said that they would do a ultrasound just to check and make sure everything was okay. So I remember sitting in the room and because of his peak COVID cases and there was not a lot of rooms or beds, there was a guy sitting outside my room on a hospital bed and I remember saying to the nurse, like, I feel so bad. Like, I feel bad that I'm in here and he is just sitting outside my room and he doesn't have a room and they assured me, oh no, they're fine. Like he was here for a broken limb or something like that and he was about to leave. But I just, I remember feeling so bad that I had a room for what seemed like it was nothing and I shouldn't have even been there and he was out there without a room. I remember then they will be back to get the ultrasound done and I was very nervous but I was talking to the ultrasound tech as I walked in the room. She was very bubbly and happy and very kind and I laid down and nervous so she kind of helped ease some anxiety and got the ultrasound on me and then the minute she got that ultrasound over where my liver tumors were, her emotion just drained from her face instantly. She went completely silent after that. She was trying everything she could not to give away that something was wrong but I knew something was wrong. She ended up asking me how's your blood pressure as they did. It's not great. And I remember her just like sighing and like she couldn't give away that something was wrong and she was trying so hard not to but I could tell that it was affecting her and I felt bad for her. I know she was trying to keep that in and she even had a stop halfway through the exam and she like sighed and like wipe sweat off her forehead and like I could tell this was upsetting for her. I felt bad for that and then I knew something was wrong at that point. Obviously they couldn't tell me what so I went back into the room. Somebody popped in for like 10 seconds just to say hey we found a few things on your liver. Don't worry too much. Some people just have them. We're going to send you for a CT scan. So then I went for a CT scan. They did a abdomen pelvis CT scan and that's when they found the lesions in my liver. And that's when I don't know the official term or the official doctor that came in to see me but whoever was head of the ER that night then came in to see me in my room after they got the results from that CT scan. So the doctor came in the room and he let me know that they had found a large mass on my right kidney and that it looked like it was kidney cancer that had spread to my liver. And I remember that moment very clearly. He had so much compassion. I'm going to cry through this. I know I am and I appreciated that so much. But I remember I didn't cry when he initially told him that which is not what I was expecting. Was half in shock and then I have felt relief which is the weirdest thing to describe. But after feeling off for so long and feeling like something was wrong with me but I couldn't get anybody to believe me or any concrete proof it felt like for the first time I felt validated and supported. I felt like for the first time the person in front of me believed me and we had a reason for why I wasn't feeling well. So there was almost a relief in having a diagnosis. Obviously it was terrifying and he couldn't tell me a whole lot because I needed to meet with an oncologist. And so we couldn't really talk about staging or anything like that but we did know that it spread to my liver and that obviously is a later stage. I remember my husband actually ended up crying before I did. It was such a weird moment. I definitely didn't end up crying there in the ER and I just didn't understand. It was so heavy to process. I remember in that moment feeling like for the first time I was going to have a team of doctors who believed me and who were on my side. And we had a diagnosis and we had a plan and we had something to move forward with. So cool. Yeah. So then I was officially diagnosed and I was to follow up with an oncologist the following week. So like I said, I went to the urgent care on December 30th and by the time I got to the ER it was about 11 pm December 30th and then I left the ER with my new kidney cancer diagnosis like 7 am. So it was technically New Year's Eve even though the process kind of started the day before. And so I did have a delay in getting to an oncologist just because of the holidays. From there what I had looked like an oncosytoma and oncosytomas are supposed to be benign. So we sent me for an abdominal MRI in January to get a better look at those liver legions because some people do just have liver legions. So it was possible that those were benign legions in that we just removed the kidney tumor and didn't have to worry about those. So that's what we were trying to rule out. Also I'd given the full history about like little sparkles and all the things that I had had in my diagnostic and so that earned me a brain MRI as well and that checked out clear which was good thankfully. And then the results from the MRI ultimately led to getting a liver in a kidney biopsy. So I got those results back in the year in January and had my diagnosis. And I went for a second opinion and my husband and I moved to Texas to go to MD Anderson in February. So that's kind of the super long story. I wonder what I will be able to cut this down to. I'm curious if anybody will make it down to the end. Thank you for watching yet another video. I don't know how helpful this will be to anybody. This is kind of just more my story and my process and I just wanted to share it because so many kidney cancers are found in diagnostics for other things which was definitely the case in my case. So long process got us here. That's my diagnostic process and yeah. That's a wrap.",
            "timestamp": 1645878262,
            "title": " Epstein bar and that was just going to be something I had to manage",
            "user_id": "@katiekickscancer",
            "video_content_url": "",
            "video_page_url": "https://www.youtube.com/watch?v=JcLkww0tEIc",
            "video_path": "sample_data/katiekickscancer/video_content/JcLkww0tEIc.mp4"
        },
        {
            "_id": "ZW2-ciZbXtM",
            "datestring": "2022-02-21 07:24:22",
            "summary": " of the week I was probably doing like five or six laps and then as the week went on I increased it to 10 or 12 laps. So that was really important for my recovery.\n\nThis is a summary of a video about a surgery the speaker had on June 29th of 2021, which was an open liver resection and right nephrectomy. This surgery is not common, so the speaker wanted to share her experience to provide information to others. She was in the hospital for 8 days, 2 and a half of which were in the ICU, and she started walking on day 2. She needed two transfusions, and her pain was usually around a 4 or 5 on a scale of 10. She had a drainage tube, an IV, and a central line when she woke up, and she was off all pain management by day 10. She walked around the hospital with a walker and increased her laps from 5-6 to 10-12 during her stay.",
            "text": " I recorded this whole long video and I forgot to describe what the surgery I had was. So the surgery I had on June 29th of 2021, open liver resection and right nephrectomy. So cutting out four or five sections of my liver to remove tumors and then we ablated 10 tumors. We went in and burned 10 tumors of my liver and then we removed my right kidney and my massive tumor. So that is the procedure that I had and the rest to follow here is to talk about what that procedure was like and what the recovery was like through that. All right, I already tried to make this video once and this video is so hard to make because there's so much information to cram into one video but I thought I tried to make it again and try to make it a little bit more succinct and just cover some of the questions that I had. So I'm going to share what a open liver section and a open nephrectomy was like for me. That's not a super common surgery to have done together but what drove most of my recovery and surgery was the liver resection portion and that's the surgery I had the most difficulty finding information about. When I was going in for surgery and I was trying to get information from other patients or find out what that was going to be like. So I thought I would share and put it out there. So talk questions that I had that I will try to cover in this explanation. I will talk about how long I was in the hospital. What my incision looks like. I'll also recover what I woke up with. What was I attached to when I woke up after surgery? How long surgery took in my case? I will also talk about things that were helpful for me to have in the hospital. How long recovery took? What that looked like? What did the progression look like over the few weeks of recovery? I'll also talk about pain management and how that was. How long it was before I could eat afterwards and then also I was in the hospital for eight days total. I need to put a disclaimer here because I had my surgery at the National Cancer Institute and they are very cautious and very thorough at the National Cancer Institute. So like I said, this is my experience with my surgery but it is very specific to where I had my surgery done and the type of surgery that I had. I also have a bleeding disorder and had a very large surgery. So my mind was very complicated. Other surgeries might not be as involved as my was. So I spent two and a half days in the ICU. I was two days and then I went back for a half a day to the ICU and then the rest of the time I was on the floor recovering. So that's how long I was in the hospital. I know I was petrified to go into the ICU. I know real experience or context with being in the hospital having surgeries before and so I thought being in the ICU meant that you were practically knocking on death store and that you weren't going to make it out of the ICU. That is not the case, especially at the NCI. They're very cautious and so most patients go to the ICU afterwards to recover and then you'll move and go on to the floor. So I was still in good shape even though I was in the ICU, they were just keeping an extra close eye on me especially because I had a bleeding disorder and that first day is really where your highest risk of a bleed is. A bleed is one of the biggest risks when you have a liver resection so that was something that we were keeping a close eye on. So that's how long I was in the hospital in the ICU. One of the other questions that I wondered about before I had surgery was how long would it be before I could get up and start walking. It'll vary for everybody but for me I started walking on day two. Day one was just laying there, not really moving, just laying there and trying to get through the day and recover. I let my body recover from the massive trauma it just went through and then day two is when I got up, moved to a chair and then eventually I took very short walks down the hallway. I did not do a lot of walking that second day but I did get up and start moving that second day. They want you to start getting up and being more active. So I have a bleeding disorder and a bleed was one of the things that we worried about the most for me. I didn't have a massive bleed which I'm very grateful for. They were very prepared in case that did happen but I'm very thankful we did not need to tap into all of the blood that we had to secure before surgery. But I did end up needing two transfusions. I needed one on day one or day two. I can't remember which one that days in the ICU are a bit of a blur and then I had a bit of an incident. I'm a fall risk as explained in my biopsy video. I almost passed out from standing out there, had a similar experience when I was in the ICU. The second time when I was back there, four short period of time and so I needed another blood transfusion after that incident but after that that was all I needed and those went well. All right, pain. So one of the things that I wondered about was is it painful? How painful is this going to be? Of course it's painful. You're going through a massive surgery but it wasn't as painful as I was expecting. Again this is just my personal experience and how it was for me but it wasn't as painful as I was expecting. Day one I thought would be horrible. I thought it would be the worst day. Day one was definitely the easiest day. Still had all the drugs from surgery and a lot of numbness happening and so I would probably say my pain on day one was maybe like a four or five and then they were also giving me pain management to make sure that we got my pain under control. So day one was pretty easy. I did not get a lot of sleep at all when I was in the hospital and especially when I was in the ICU they're checking on you constantly. So not a whole lot of sleep happens at least for me. So the pain did pick up a little bit on day two and it's being continued forward but I had a little pain but neck push to help alleviate some of that pain. I'd probably say that while I was in the hospital my pain was probably always around a four or five. Occasionally it would get up to a six but then we'd get under control and it would come down a little bit more. A lot of people will end up having a epidural for pain management through some of these surgeries because I had a bleeding disorder. We couldn't do an epidural for me so I can't remember the name of the drug. I used to know the name of it but I forgot it but I had a push button that I could use to give me any pain management which helped and did great. It was also off of all pain management by day 10. I probably could have been on that a little bit longer and I did have clearance to be on some of the medications longer but I was mainly on Tylenol and oxycodone at that point and I tapered off all of it. I probably should have been on it a little bit longer but I'm stubborn. It's just not a good characteristic. Don't be like me. So that was what pain management looked like for me. I know pain wise and a couple other things that I was worried about. I was also worried about I had a tube that was hooked up to me a drainage tube when I woke up from surgery and it was really worried that that was going to hurt to get taken out. That did not hurt. It felt weird for sure when it comes out. It's a weird sensation but that didn't hurt at all. Same with having the urine catheter fully, fully I never know how to pronounce that. Having that taken out I was worried that was going to hurt. Also it didn't hurt. Still not a pleasant feeling and weird but it did not hurt. I think those are important things to talk about because those were things that I was worried about for my surgery which leads me into one of the other things I wondered about. What am I going to wake up with after surgery? I went back for surgery and I had one IV in so they could start the anesthesia and I wasn't sure what I was going to wake up with. So this is what I woke up with. So I probably had a few more IVs just to make sure that if I did have a bleed they could get everything in fast enough. What I woke up with I had four IVs. I believe one of those was an arterial line which was used to help track blood pressure in different things and then I also had a central line in my neck. That one I really worried about through my stay. I will talk about that in the video I make about my actual story and the process of my surgery but this video I'm trying to keep a little bit more tactical so I'm just talking high level of details. The incision I will show in a video of what my incision looked like. Walking so walking is really important for your recovery so once I got out of the ICU I walked a lot. They would always put a number up on my board and I'm a very determined person and so I would always make sure that I walked more than whatever they told me to. I don't know it. There's not a whole lot you can do in the hospital so that was my little game that I was playing with myself. I walked over a mile doing laps around the station and it was not unassisted. I had to use a walker to walk the first like week or so. I also used that walker to get up and down. If I needed to go to the restroom, if I needed to get out of bed I had to use a walker to do that for a while. I didn't have the mobility and it hurt to do it without it so did use a walker to walk around. Here are some sweet videos of me walking with a walker. If I can figure out how to put videos here, ish, otherwise you're just staring at my hands being a plate or whatever this is. So doing laps was really important. I did not like being in the hospital bed and so I stayed in the chair most often because I knew that would encourage me to get up. I was getting up probably about every two hours and I'd get up do a couple laps sit down. Get up do a couple laps sit down. Beginning I could only do like one lap or two laps around the nurses station and then eventually got up to the point where I was like doing four or five laps a session and then I'd sit back down. How soon after surgery can you eat? I think it was about four days when I was approved for full just normal solid food diet again. I think I probably could have had food a little bit sooner than that but that is when I had my first meal. I had a turkey dinner as my first meal. It was delicious. I was so ready for food. I was so hungry. I know a lot of people, many people don't wake up with an appetite. I was hungry. I was ready to eat like day two. My appetite was fine. I was ready. I was ready to eat. So that meal was delicious. Also as a prerequisite to leave the hospital so they had to move a bunch of things around during surgery and so it's really important that you have a bound movement after surgery. Make sure everything's working properly and so I this is really weird to put out on the internet. It's talk about this but it's part of the process so let's get personal. So I had a bowel movement on a day between two days five and six. I think it I thought it would happen immediately after I ate and it did not. It was around day five or six. Getting up and walking and moving was really important to help get everything moving as well. All right so I was in the hospital like I said for eight days. Part of that I think they were going to send me home on day seven but we had to keep an eye on my blood levels because of my bleeding disorder so I stayed a little bit longer to make sure I was in range there. But I went home and then my husband and I stayed in a hotel. We probably didn't need to do this but I was really worried and wanted to make sure that I was nearby in case anything went wrong. And so we stayed for a month in Bethesda, Maryland. We're originally from Texas so we drove up to Maryland for the surgery and we stayed in an extended stay hotel that had like two rooms a bedroom and then like a living room area and mandated we get cabin femur in there. It was in there for a month and couldn't really go out and do a whole lot of anything obviously because I wasn't very mobile. But I it was still very important for me to walk. So I aimed to walk between six and eight thousand steps every single day and it was hard and I was just walking back and forth. I'm room to room to room to room to room. Sometimes I'd go out in the hallway and go up and down the hallway but I did a lot of walking. It hurt. For me I don't quite know what was causing the pain. I had a very large fluid collection that happened after surgery. It happened by where we made the largest wedge reception to remove the largest tumor from my liver. I don't know if that was causing part of the pain but like it would hurt to take a full deep breath. We checked. Made sure I didn't have any blood clots or anything like that. But that made sometimes walking a little bit harder. I did finding I got through the process. I have tacky cardiac issues and pots which is postural tachycardia. So standing and walking really raises my heart rate. So that was exacerbated by surgery for me and limited me a little bit in my walking. I especially found it really hard to walk in the heat. So I spent a lot of time inside doing my walking. So right as I got out of the hospital I was still using the walker. Here's a picture of me using a walker in the hotel. And then I think a few days later I got to the point where I was able to walk without the walker and I was walking almost without the walker. Very, very slowly. So it took longer than I expected to recover. One of the other questions I had was how long will it take for the incision to heal? I would take about six weeks for it to heal. By the time I got to six weeks mine was definitely not healed yet. And I don't know if that was because of the medication that I was on before surgery and maybe it wasn't fully cleared out of my system. I was on a TKI and it prevented healing. It was a systemic treatment for to treat cancer before surgery. So I don't know if that had anything to do with it or just because I had such a large surgery. But I was definitely not completely healed at six weeks. I actually started to get a little bit of a rash. We used surgical glue instead of sutures. We did internal sutures I believe and then surgical glue on top to close my incision. I had a allergic reaction to the surgical glue. It started around week three or four. It's start to get a little specks, little dots of red around the incision or like the outside. And then that slowly grew bigger and bigger and bigger. And so around six weeks the glue was still hanging in there. And I think for most other people it falls off by then. But my glue was very much still intact. And I actually ended up, my surgeon instructed me to pull glue off at about six weeks. I was healed up enough that it didn't cause any bleeding or anything like that. But I did still have some spaces that needed to heal up and close. So I think it took between seven and a half and eight weeks for it to fully close. But again, I don't know if mine took a little bit longer than most people's due. But I know it was something I was worried about. So that I'd share that in case anybody else takes a little bit longer to heal. It took me a little bit longer to heal up. Things I was grateful to have while I was in the hospital, a super long phone card, get like a 10 foot phone cord. It's super handy to have. I also had a really large driven to cure jacket. It was so nice to have during surgery. It was cold when I would go walk the halls. And I also got brought a bunch of really baggy clothing. Made sure I made a hospital bag. And I wore my husband's sweatpants and got really big t-shirts. And I was able to change into those instead of having to wear the hospital gown after a couple days, which was nice. And so whenever I went to go walk in the hallway, I would use my driven to cure jacket that had really big like arms because it was an oversized jacket for me. And so that was really nice because I could fit my IVs through that. And I could take that out in the hall. So that was really, really nice to have. When I got home, things that were really nice to have, I had a wedge pillow. It's really uncomfortable to lay flat after you've had abdominal surgery. And so the wedge pillow helped keep me lifted partially up so that it didn't hurt so much. And so that was really nice to have. Also, it's difficult to sit up because you don't have any abdominal muscles that you can be using. And so the wedge pillow also helped me so that you can like put your arm up and like twist the side a little bit and get some leverage to get off of the bed. So the wedge pillow was extremely useful. I'm so glad I had that. I also had a shower chair. Again, I'm a bit of a fall risk when I'm standing especially in the heat. I don't have great heat tolerance. And so I used a shower chair and my husband helped me shower for a couple of weeks after surgery. I think it was like three weeks before I could actually fully shower without him like they're in the bathroom in case like I needed help. But definitely relied on him a lot those first couple of weeks. Which I'm so grateful for. He is amazing. So recovery felt slow, but it slowly added up. Your recovery from day one to the end of week one is massive. And then from week one to week two is pretty big jump too, but not as substantial. Week three, I ended up hitting a point where I felt like, oh am I ever going to heal and am I always going to hurt? I literally said that to my husband. Being very dramatic of course. I felt like I was never going to heal, but I did. And it just, it doesn't happen as quickly. I had a low grade fever. My fever was around a hundred degrees for about a month. And I also had night sweats for about a month. I don't know why I had that. I've heard that a very low grade fever can be calming after a liver resection. And like I said, so I had night sweats after a month, but that went away. I also had extreme brain fog. Really worried that that was going to stick around. And how did it longer going to be able to code? That's also part of the reason why I stopped the medication earlier. And then it was just a slow process of recovery from there. I went back to work at seven or eight weeks. I probably could have gone back a little bit sooner, but I was really focused on making sure that I was walking plenty and making sure that my body was fully healing. But I was feeling pretty well at that point. It still hurt the laugh. It still hurt the cough. It still hurt the sneeze. That lasted for quite a while for me. And I don't know if I had anything to do with that large fluid pocket that I had. That fluid pocket also ended up going away around six months. So we found it one month after surgery. It was still there on the three month scans. And then when we did six month scans, it almost had completely resolved. That's also when a lot of the pain had gone away from when I like would cough or sneeze. I don't know if that's related at all. Or if that was just part of the process and happened to happen around the same time. About four or five months is when it stopped hurting to cough or laugh or do those things. So it lasted longer than I was expecting. But I feel great now. I actually can go jogging now. I don't go for super long because I'm not in shape because I got a bit de-conditioned at first surgery. I just did lots of walking. But I was even able to jog the other day. And it felt amazing after not being able to do that for so long. So this video still ended up being long. And it was probably all over the place. I was trying to fit a whole lot of information into a short little bit. But I hope it's helpful. These are some of the questions that I have of our surgery. I hope they help answer any questions that anybody else might have. And feel free to reach out to me or put in the comments. Any additional questions you have. I'm happy to make more videos and answer any of those questions or just answer in the comments. I would love to help anybody who has any questions about a liver or a section or anything like that. I'd love to help provide any experience that I have that could help out. Yeah, I just, I was looking for this information. So I would love to help other patients be able to access it. And I might not be able to answer all your questions. But I can tell you what my experience was like. And then I can also help you know what questions to ask your doctor. All right. I am going to wrap up this video. It was so hard to make. It took me so many times. There's so much information to try to get in here. No wonder other people haven't made these videos. They're hard to make. And I just felt like I was rambling. So I'm sorry. Thank you if you listen to this whole thing. I hope it's helpful. If you ever need to go through a surgery like this. Yeah, I will make another video where I talk about what the entire surgery process was like for me. That I might break up into two videos. Pre-surgery and post-surgery because I had so much happened. And it was a big part of my treatment. And so I will share another video. Maybe this weekend. I'll record that one and talk about what the surgery process was like. But I wanted to make this video a little bit more tactical and share some of the basic high-level information for my surgery. So that's it. So like and subscribe. Do the things. Is that going to be my tagline? I don't know. I still don't know what I'm doing.",
            "timestamp": 1645446262,
            "title": " of the week I was probably doing like five or six laps and then as the week went on I increased it to 10 or 12 laps",
            "user_id": "@katiekickscancer",
            "video_content_url": "",
            "video_page_url": "https://www.youtube.com/watch?v=ZW2-ciZbXtM",
            "video_path": "sample_data/katiekickscancer/video_content/ZW2-ciZbXtM.mp4"
        },
        {
            "_id": "Iue_GsVen0U",
            "datestring": "2022-02-16 07:24:22",
            "summary": " came in and I was still kind of out of it. I had a nurse holding my hand and she was talking to me and trying to get me to respond. And then they started giving me blood products to try to help the blood clot and stop the bleeding. And so they did that for a few hours and then I was able to get up and walk out. So that is my story about my biopsy.\n\nThis article discusses what a biopsy is and what the process looks like. It also shares the story of the author's biopsy experience, which included a rare complication of bleeding due to a pre-existing bleeding disorder. The article explains that biopsies are typically done in outpatient settings, with the patient receiving sedation and local anesthesia before the procedure. It also mentions that biopsies are not done in some cases, such as HLRCC, and that seeding is a rare complication. The author emphasizes that it is important to trust your oncologist and that the risks of biopsy are outweighed by the benefits.",
            "text": " All right, I wasn't really sure where to start with these videos, but I thought I would just start at the beginning and talk about what the biopsy process is like. I know that is something that I was scared of when I first got diagnosed, and I didn't know what it was going to be like or what to expect. And so I thought I'd share a little bit about what that process is like, and then I will share my story and with my biopsy was like towards the end of it. I did have some complications with my biopsy, and that is super rare. But I think it can be beneficial to hear and understand those stories so that you cannot be so scared of them. All right, so biopsies. What is a biopsy? A biopsy is where they basically can stick an edel into a tumor to grab out some of the cells so that they can look at it under a microscope. That is how they determine what type of cancer that you have. They oftentimes won't biopsy earlier stage tumors if it hasn't spread anywhere else, and they plan to do surgery anyways. In those cases they'll typically just take the tumor out and then they'll send it off to pathology after it comes out. There's no need to go through a biopsy in those scenarios, but always just defer to your oncologist. Whatever plan they've picked for you is going to be best for your specific scenario. There's also a few cases that they don't biopsy. HLRCC is typically one that they try to avoid biopsy. If they find a lesion and you're in candidate for surgery, they'll typically just take those out instead of biopsying them. HLRCC is hereditary, so you typically have a family history of kidney cancer in that case. They can do some gene testing to find out if you are likely to have HLRCC. One of the things I know I was most concerned about when I had a biopsy is I heard about seeding and I heard that people didn't do biopsies because of seeding and it can cause a cancer to spread. I think that's important to talk about because I was very fearful of it and I thought like, okay, if we do this biopsy is it all so I'm going to grow in my lungs? I didn't understand what seeding was or what really the risks were there. It was something I had heard and was scared of and I just want to say that that's not something that you need to worry about. If your oncologist sent you for a biopsy, then they think the benefits outweigh the risks and you should be going for that biopsy. There are a few case reports in history of seeding and that's typically with older methods that are no longer used for biopsies. Also in the few cases that there was seeding in the past, it didn't spread somewhere else random place in your body. It grew along the track from where the biopsy was done at. So like you can see the need to go in and out that is where the cancer would go and spread. But like I said, that is extremely, extremely rare now, especially with new practices and so it's not something that you need to be worried about. I know I wish I would have known more about that, I spent a lot of time worrying about seeding before I had my biopsy. But again, I was very cancer and naive. So the process for biopsy, they will send you in and it will likely be an outpatient procedure meaning you do not have to have a hospital stay for it. You'll go in, you'll fill out a few papers to sign and give permission for the biopsy. And then they will put you under a type of sedation. It's not general anesthesia typically, so they don't completely knock you out. They want you to be conscious so that you can respond to questions as well as like breathing. So for example, during mine I had to breathe in a certain way in order for them to go in and everything kind of be holding still while they went in and did the biopsy. So they want to make sure that you're conscious for that. But the drugs they give you will ease your anxiety. So I am a very anxious person and I got very worried and I was scared the whole time and the drugs help. So you'll be fine. Also my kidney biopsy was a walk in the park. I was super scared that it was going to hurt. It didn't hurt at all. I didn't feel a thing. So once they give you the sedation, I don't, I don't know if that's the proper term. But once they give that to you, you're nice and relaxed. I rolled over to my stomach and they did the biopsy through my back. They give you some local anesthetics as well. It's not the right word. I don't know the right proper terminology for any of this stuff. But they treat the area locally so they can't feel anything either and then they stick the needle in, grab the tumor cells, pull it back out. And then they usually have pathology in the room there so that they can take a look and make sure that they got a proper sample. And if they do, they say, cool, all good. And you're all set to go recover. And so typically if you only have a kidney biopsy, that's all they'll do. They'll put a little bandaid over it and then they'll send you to a recovery room where you will recover. You'll typically lay flat for a couple hours. They don't want you moving so that your body can kind of heal up and heal any bleeding or anything that was happening. And then they will send you on your way after that. Basically they just monitor you to make sure that there's not any bleeding and that you're going to be okay and then they'll send you home. So super easy process. My kidney biopsy was a walk in the park. I was so nervous about it and I did not need to be. So I hope that helps people who might be going for a biopsy. It's a pretty easy process. You will get the results typically anywhere I think three days is pretty fast. But I think it's like between three and seven days you'll get the results back from your biopsy typically. Takes a little while to get the results but then they'll be able to tell you what type of cancer you have and specifically the subtype which is the most important part. All right. So that's how the process for biopsy goes in general. As I said that I would share my story about what it was like for me. So my kidney biopsy was a walk in the park. It was super easy. My liver biopsy, they did a biopsy of my liver and the liver is much more vascular so there's a higher risk of bleeding. I knew that going into that. And it was something I was super worried about but it rarely really happens. It's a really rare complication but it can happen. I did end up having a bleed during my liver biopsy and it happened to me because I have a bleeding disorder. So we did find out that I had a bleeding disorder. It's not something I knew at the time and something I found out afterwards. And I wanted to share the story because I know I was absolutely petrified of this happening and I thought, okay, if I get an internal bleed I'm going to bleed death and die and I was scared. And so I know before I went for my biopsy I was so scared about that. And I think it helps to share my story to help other people understand what it looks like when there is a complication or something does go wrong. So I had my kidney biopsy and then we world me from my stomach onto my back so that we could get to the liver lesion that we were going to biopsy. Same thing I had, I still had the sedation and then went in. I think it took two approaches for the liver. I kind of felt the second one. So I definitely felt it more than I felt the kidney but it wasn't super painful or anything like that. And then it was over. They got all the samples that they needed. So before they send you on your way and to the recovery room they run the ultrasound back over. The ultrasound is what they use to guide the needle. So basically they'll be running the ultrasound on you and they'll be looking up at the screen to see where the needle is going. And so they do that afterwards. They run the ultrasound back over that area to make sure that there wasn't any bleeding. And there wasn't when we first looked for mine. So the doctors left the room and then I started to feel really not well at all. I just didn't feel good. I was telling the nurses that I don't feel good and they're kind of like, yeah, it's probably just a medication and I'm like, yeah, no, I really don't feel good. And I started to get that feeling like I was going to pass out. I started to get really, really hot, my hands were clammy. I was like, I'm so hot. Can you please take these socks off of me? And I was like, I just don't feel good. I don't feel good. And then I felt I hit that feeling where I was, okay, I'm about to pass out. And so like, can you please get that doctor? I don't feel good. And so they went and got the doctor. And then the doctor came back and I was like, I don't know why I'm feeling this way. But I also was like, am I supposed to be having pain in my shoulders? That normal? And the minute I said that, the doctors said get the ultrasound right back on her. So what I was having was referred pain. Basically, I was having a bleed that came from the area that was biopsy to my liver. But that pain was being referred to my shoulder. And so I was feeling that pain in my right shoulder. And so when they did the ultrasound, they did see that I was bleeding. And it caused a bunch of panic. It sparked kind of a blur for me a little bit. I was not feeling well. I started to get the dark tunnel vision. I knew I was going to pass out all of a sudden my blood pressure started tinking. I saw the nurses kind of panicking like her blood pressure to crashing. And then another nurse was on the phone and say, okay, she'll call her husband. And so they called my husband. And I just remember like focusing on the corner of my eye. Like I did not feel good. And the fellow had taken my legs and lifted them up to try to get the blood to flow to my head. And then I started looking up at the nurse. There was a phone on the wall in the corner. And I just remember looking up as she was calling my husband and was like, things didn't go quite as planned. We have had a little issue during the biopsy and you should probably come in. And so my husband was waiting out in the parking lot because of COVID. And so he was able to come in at that point and he was going to go up to the room that I was going to be taken in after that. So I just remember I was so scared in that moment. I felt like I was passing out. I remember being scared because like this is what I feared. And I thought that you have a bleed in your goner. And so I remember the fellow and the doctors around me just said, hey, stay with me. Stay with me because I just like, I don't feel good. I don't feel good. It was just the feeling of passing out, but it was scary. And so I remember them trying to do everything. And so then they rushed me into a emergency CT scan. And during that time I started to feel some pain in my lower abdomen. And I remember telling the doctor, I said, I'm starting to get some pain. Like in my pelvis area, it kind of feels like the pain that I get from cramps. So they did a abdomen pelvis CT. And we saw that I did have a bleed. It was a moderate bleed. Not a major bleed. I think that it was feeling my lower abdomen was because some of the blood was training down in that area too. So I also had a lot of pain. Like I couldn't really move very well. It hurt to take a deep breath. It hurt pretty bad to take a deep breath. And that's because I had a lot of blood in that area. And it was irritating my diaphragm. So it made it difficult to take a take large breath. But once they saw that bleed, they saw as moderate, they decided, okay, we're just going to keep an eye on it. So they sent me back to the recovery room. The same room that everybody goes to after a biopsy and you wait there for a couple hours. So I was laying flat and then I had to go to the restroom. And so they told me to get up. I think that I probably got up earlier than I was supposed to because I was only in there for like an hour. And then I had stood up at the end of happening in that time frame. But I went to go stand up and it hurt bad to move. Like I said, I had a lot of blood in there. It was causing some pain. So standing up, I started to get the tunnel vision again. So it was going to pass out. They laid me back down again. My blood pressure crashed. A whole bunch of commotion from the nurses. And then we decided after that that they were going to emit me, which took a really long time to get admitted. It's also peaked COVID cases. And so there was not a lot of rooms or beds. We eventually got me admitted to consp and cancer institute. And they were incredible and amazing. And I'm so grateful for that. So I was laying in that bed for a while, recovering. They gave me some fluids to raise my blood pressure, which helped. And then the fellow and the attending, the fellow, someone that did the procedure and the attending came back up to the recovery room. And they checked in on me several times, which I was so grateful for. And I could tell that they were genuinely concerned about me. I think about that often in that moment often. And as I share some of these stories, I'm probably going to get to you guys. They had a very big impact on me. It was a very scary moment in my life. And they were there for me. And I knew that it was not standard practice for them. And so it was just one of those moments that I could tell that they genuinely cared. And I went a long time before I got diagnosed feeling like I was dismissed by a lot of doctors. So it was kind of a pivotal moment for me where I felt like I was finally being looked after and really cared about. I remember at one point, so Anko Saitama's looked a very specific way. And on scans, they have what's called a central scar. And my radiologist had looked at these scans. And that's why he thought that it could have been an Anko Saitama. And he'd actually written textbooks describing the imaging of an Anko Saitama before. And so the fellow was in the room and my attending was in there. And they were just checking out me seeing how I was doing. And as I was talking to them, I got to ask them all kinds of questions, which was awesome. Like, a lot of people don't get that opportunity. They don't. Most people don't get a chance to talk to the radiologist. And so I'm a very inquisitive person. So I asked all kinds of questions about why they thought the imaging looked a certain way. And he described kind of how he saw it. And he described how Anko Saitama's looked. And just gave me a lot of information. And they just chatted with us. I mean, they answered any medical questions I had too. But they also just talked to my husband. And I just like, we're just normal people. And they had a genuine concern for me. They were amazing. They stayed late in the night. I think I finally got admitted around like eight or nine. And they both were still there. So I got admitted I stayed overnight the next day. So they don't normally have like a service for interventional radiology just that by and check on patients because it's usually like oncology or surgery or somebody like that that's going in and doing rounds on these patients. But the attending came back. I remember as they were wheeling me over to Huntsman, there's like a little hallway that takes you in between the University of Utah and Huntsman Cancer Institute. And I remember as they were wheeling me across there, the doctor let me know that he had to take his daughter to school the next morning. But then he was going to stop by and check on me. And he did. He stopped by the next morning and he made sure to check on me before they discharged me. And I wasn't normally part of a service that he had. And he doesn't normally check in and do rounds on patients. And so there was already a doctor that had done rounds for me. He was just stopping by to make sure that I was okay. And that meant a lot to me. And it just really showed me very early on how much these doctors truly do care. And it just meant a lot. It was a small gesture that he did, but it meant the world to me. And I wanted to share the story and kind of what happened to me through that process. It was very scary at the time. And it was painful. I won't lie. It was painful. But I didn't take any pain medications and that's part of it. They gave me clearance to take pain medications. But I just, I didn't want to because I wanted to be able to feel, I could feel when the bleed was getting worse because the pain would get worse. And so I didn't want to take pain medications. And so I avoided it. But I probably could have prevented myself a lot of pain if I had just taken them. I just want to share this story because I know I was really scared when I was going through the biopsy process. And I got scared of what could go wrong. What happens if there's a bleed is at the end. And so I wish I would have had a story like mine to have heard to know that everything will be okay. So I was in the hospital just overnight. They watched me and then I finally got to the point where I could get up and go to the restroom on my own. I was still in pain and it still hurt to breathe. But I got up and moved around a lot and that really helped my body heal. And after I think five or six days I was walking like a mile or two again. And just had little band-aids over their spots, had a little bit of bruising. But nothing major. It did take like three weeks, two or three weeks I think from my body to clear all of the blood that was kind of hanging out in my body afterwards. And for my hemoglobin to come back up. But it came back up. Everything normalized and my body fixed itself. We did end up giving me some fluids that raised my blood pressure but the rest kind of fixed itself on its own. There are people who have bleeds that do need interventions after biopsy occasionally. I was not one of those cases. But I just wanted to share that story because I think if I had seen somebody go through what I went through before I went through it, I would have been less fearful of it. And so I wanted to share my story in case it can help anybody else. But it's supposed to be real long. Again, I don't know if I will figure out how to make these videos shorter or be more succinct. Let me know if these videos are too long in the comments. Like I said, I'm just getting started with this. I hope this is helpful. If it's not, I'm open to feedback. Tell me what's helpful. What do you want to know? Do you want long videos, short videos, medium videos? I don't know. Just tell me when you want. And I'll help make videos the best I can. I hope this is helpful. I hope that helps to understand what the biopsy process looks like for kidney cancer and what it looks like to have a liver biopsy and complication. That's it.",
            "timestamp": 1645014262,
            "title": " came in and I was still kind of out of it",
            "user_id": "@katiekickscancer",
            "video_content_url": "",
            "video_page_url": "https://www.youtube.com/watch?v=Iue_GsVen0U",
            "video_path": "sample_data/katiekickscancer/video_content/Iue_GsVen0U.mp4"
        },
        {
            "_id": "BvVzcobqjck",
            "datestring": "2022-02-05 07:24:22",
            "summary": "\n\nKatie is a 29 year old woman who was diagnosed with stage 4 kidney cancer on New Year's Eve, two months after her wedding. She has decided to make a YouTube channel to share her story and the treatments she has gone through, as well as to provide information about kidney cancer for other patients. Katie's tumor was 12 centimeters when she was diagnosed and 10.5 centimeters when it was removed after six months of systemic treatment. She is the only person in the US with her official diagnosis and is sharing her journey to help others navigate their diagnosis. Katie is grateful for the team of doctors who have helped her get to where she is today, and she hopes her videos will provide helpful information and resources for others.",
            "text": " Hi, my name's Katie. I was diagnosed at 29 years old with stage 4 kidney cancer about one year ago. I was diagnosed on New Year's Eve and two months after I had gotten married, so I was a newlywed. So to say things changed quickly would be an understatement. I decided I want to come and make this YouTube channel because when I first got diagnosed, I found it really hard to find information. And one of the first places I went was YouTube, as we do these days. And I couldn't find the information I was looking for. It was really difficult. And I found that there wasn't a whole lot of information out there. So I wanted to start making videos to see if I can help create some of that content for other patients to turn to in the future. When I was diagnosed, I had a really big tumor. The tumor that I had on my right kidney was about 12 centimeters when I was diagnosed and 10.5 by the time we took it out six months later during surgery. It shrunk because I was on systemic treatment for a couple of months. So in these videos, I will share kind of my own story and diagnosis. I will also share the treatments I was on. I will share the different types of treatments that are available in kidney cancer. They are different from other types. I was completely cancer naive when I got diagnosed. So I thought everybody was on chemo. I thought everybody lost their hair. I didn't understand the different types of treatments. So that's something that I want to help educate other people about who might be new to a diagnosis as well. And I just want to create content to help other patients navigate the diagnosis a little bit better. I felt so very lost and alone when I was first diagnosed. The type of cancer I have is incredibly rare. We think that I'm the only one in the US with my official diagnosis right now. So super rare. I do have kidney cancer. I just have a very rare type. And there are lots of different types of kidney cancer. And they're all different and they all respond differently to treatment, which is very important to learn and understand. We need first to diagnose because it can be kind of confusing, understanding why one person might be on one treatment while you're on something else. And so I hope to kind of help provide some of that clarity. I was very lost when I got diagnosed and I felt very alone. I've spent a lot of time learning as much as I possibly can. I'm by no means an expert and I'm not a doctor. But I'm just here to put out content to help other patients and try to help navigate this crappy diagnosis. I have no idea what I'm doing as my first YouTube video. So we'll see how it goes. But please follow along if you'd like to learn more about kidney cancer or just want to hang out for my journey. I am in such a different place this year than I was one year ago. And I have so much to be grateful for. I feel the best that I felt in my entire life. I realize that I have a very rare situation and I am very fortunate and lucky to be in the spot that I'm in. But I had to learn a lot about self-applicacy. I had a lot of struggles along the way. I have many times that I was told I could never be cured. I'm still not cured yet. But I feel so much better than I did. And there are so many doctors that didn't think that I could be in the place that I am right now a year ago. I am in a completely different spot this year. And I owe so much of that to an incredible team of doctors, my oncologists, my surgeons, and so many people who took a chance on me with nobody else would. I was told no so many times for surgery. And there are so many people who thought that I would not be in the position that I am in right now one year ago. So I will be here to share my journey and my story how I got here, the different treatments I was on, the surgeries that I've had, and try to help put that information out there for other patients. I remember I went on YouTube before I was diagnosed and I looked up what's a liver resection like because I had no idea. And it was really hard to find information from patients who talked about it. So I want to help kind of be that resource for other people. And I hope it's helpful. So follow along. I have no idea what frequency I'm going to post videos at. I am a complete newbie to YouTube. I have no idea what I'm doing. But we'll learn together. So please bear with me as these first couple videos may kind of suck. But I will try to put out the best content I possibly can about kidney cancer and try to help spread knowledge along the way. If I can subscribe or something. Do the things, I don't know, what do people say on YouTube? Lever. Hi Dora, that's my cat. That's my trans-sissche. So I know to cut.",
            "timestamp": 1644063862,
            "title": "\n\nKatie is a 29 year old woman who was diagnosed with stage 4 kidney cancer on New Year's Eve, two months after her wedding",
            "user_id": "@katiekickscancer",
            "video_content_url": "",
            "video_page_url": "https://www.youtube.com/watch?v=BvVzcobqjck",
            "video_path": "sample_data/katiekickscancer/video_content/BvVzcobqjck.mp4"
        }
    ],
    "user_handle": "@katiekickscancer"
}